{
  "nodes": [
    {
      "id": "Module_0",
      "type": "Module",
      "properties": {
        "name": "DATABASE MANAGEMENT SYSTEMS Introduction to Databases: Introduction, An Example, Characteristics of Database approach, Advantages of using DBMS approach, When not to use a DBMS Database System Concepts and Architecture: Data models, Schemas and instances, Three schema architecture and data independence Database languages and interfaces, The database system environment, SQL: SQL Data Definition and Data Types specifying basic constraints in SQL, Basic retrieval queries in SQL, Insert, Delete and Update statements in SQL, Additional features of SQL, More complex SQL Queries, Specifying Constraints as Assertions and Triggers, Views (Virtual Tables) in SQL, Schema Change Statement in SQL. CONTENTS An example of data is a students test score Ex: The average score of a class is the information derived from the given data. Data means recorded facts or Known facts that have implicit (unquestioned) meaning are stored on computer media. Facts, figures, statistics etc. having no particular meaning. The Data can be: Structured : numbers, text, dates Unstructured: images, video, documents Example :( USN,name.age ) a)1,Ramu, 19 b)23,Suma,20 WHAT IS DATA? Information : data processed to increase knowledge in the person using the data Metadata / System catalog : data that describes the properties or characteristics of the data, including data types, field sizes, allowable values, and data context user data. CONTINUED..  A database is a collection of related data or information, which stores data in form of table. A Database: collection of interrelated data + description of data WHAT IS DATABASE ? information, which stores data in form of table. Fields Table Name : EMPLOYEE SSN Name Age Address Dno Salary 123467 Aruna 25 #45,Bangalore 5 20000 123469 Suri 26 #35,hassan 4 12000 123468 Mohan 27 #23,Bangalore 1 15000 123567 Jagadish 28 Null 5 20000 Table Name : DEPARTMENT Dname Dnumber Dlocation Research 5 Bangalore Administration 4 Bangalore Headquarters 1 Bombay Fig :A database that s tores employee and department information Record s Def 1: Database is an organized collection of logically related data Def 2: A database is a shared collection of logically related data that is stored to meet the requirements of different users of an organization Def 3: A database is a self-describing collection of integrated records Def 4: A database models a particular real world system in the computer in the form of data DEFINITIONS OF DATABASE Database System A database system is a software system, which supports the definition and use of a database DDL: Data Definition Language DML: Data Manipulation Language WHAT IS DB SYSTEM? A DBMS is a collection of interrelated files and set of programs that allow users to access and modify these files. or A DBMS is a collection of programs that enables the users to create & maintain a database. DBMS is general -purpose software that facilitates the process of defining, constructing, manipulating and sharing database among various users and applications. DATABASE MANAGEMENT SYSTEM (DBMS) A Database Management System (DBMS) is: A software system designed to store, manage, and facilitate access to databases. The primary goal of a DBMS is to provide a way to store and retrieve database information that is both convenient and efficient . The DBMS Functionality Defining a Database: It involves the specifying types of data types, structures and constraints of the data to be stored in the database. Constructing a Database: The process of storing the database on a secondary storage medium . DATABASE MANAGEMENT SYSTEM (DBMS) Manipulating a Database: It includes functions for querying (retrieve specific data), updating, reporting, insertions, deletions and modifications to its content. Concurrent processing and sharing by a set of users and programs  yet, keeping all data valid and consistent. Other features : Protecting the Database : It involves the two types of protection i.e. system protection against hardware/software (crashes) and security protection against unauthorized access. Maintaining the Database : Maintain the database over long period of time . Examples : Access, Oracle, MySQLServer , dBase, Sybase, Clipper, MySQL, PostgreSQL , Apache Derby, SQLite , Ingres, etc. CONTINUE.. SIMPLIFIED DATABASE SYSTEM ENVIRONMENT  Traditional Database applications : The information stored and accessed in computer either numeric or textual pattern ..  Multimedia Databases : Store picture, video clips and sound message. Geographic Information Systems (GIS) : It can store and analysis maps, weather data and satellite images. Data Warehouses and online analytical processing (OLAP) : This is used for decision making Real -time and Active Databases : It can be used in controlling industrial and manufacturing processes. Database Search Technique: Used in World Wide Web (www) to improve the search for information that is needed for browsing in the internet . Mobile databases DIFFERENT TYPES OF DBMS  DATABASE APPLICATIONS Data can be stored in RAM this is what every programming language offers! RAM is fast, and random access Isnt this heaven? Every OS includes a File System manages files on a magnetic disk allows open, read, seek, close on a file allows protections to be set on a file drawbacks relative to RAM? File processing system was the earliest storage type database system. In file processing system the permanent records are stored in various files, and different application programs are written to extract records from, and to add records to appropriate files. Each program defines and manages its own data . FILE PROCESSING SYSTEM VERSUS A DBMS Program and Data Interdependence Uncontrolled redundancy( The same data stored in multiple places ) Inconsistent data( Incorrectness in data entry) Inflexibility Difficulty in accessing data Data isolation Integrity problems Atomicity problems Concurrent access anomalies Security problem Limited data sharing Poor enforcement of standards Low programmer productivity Excessive program maintenance Excessive data maintenance THE FILE SYSTEM HAS SOME DISADVANTAGE Same data is held by different programs. Different systems/programs have separate copies of the same data The different values and/or different formats for the same item. Waste of space to have duplicate data Causes more maintenance headaches The biggest problem : When data changes in one file, could cause inconsistencies (Vulnerable to Inconsistency) Compromises data integrity (data reliability) DUPLICATION OF DATA (DATA REDUNDANCY)  Incorrectness in data entry . Example: A changes made in customer address in savings -account records will be reflected but not in other files of banking system this makes the data inconsistency.  INCONSISTENCY DATA CUSTOMER_SAVING Account_number Name Age Balance Address 123467 Aruna 25 20000 #45,Bangalore 123469 Suri 26 12000 #35,hassan 123468 Mohan 27 15000 #23,Bangalore 123567 Jagadish 28 20000 #323,Bangalore 123467 Arun 25 20000 #45,Bangalore Spelling Mistake in name field CHECKING_ACCOUNT Account_number Name Address 123467 Aruna #45,Bangalore 123469 Suri #35,hassan 123468 Mohan #23,Bangalore 123567 Jagadish Null Changes not reflected Inflexibility : If any necessary changes like adding a file or extend the data elements in an existing file the entire file has to be changed. This makes the affecting the stored data and the existing applications programs. Example: In student table need to add email id to existing DB.  CONTINUED.. USN Name Age Address 123467 Aruna 25 #45,Bangalore 123469 Suri 26 #35,hassan STUDENT Difficulty in accessing data : If requested query is not designed for original system. Then check the particular file to get the requested information manually or ask the system programmer to write the needed application program. Example: If bank officers needs to find out the names of all customers who live within a particular postal -code area in a citys . There is no application program on hand to meet it in the original system. The file -processing systems do not allow needed data to be retrieved in a convenient and efficient manner. CONTINUED.. Data isolation : The data are scattered in various files, and files may be different formats, it is difficult to write new application programs to retrieve the appropriate data.  Integrity problems : The data values stored in the database must satisfy certain types of consistency constraints. Example: The balance of a bank account may never fall below Rs.500 . Developers enforce these constraints in the system by adding code in the various application programs. If new constraints wanted to add, it is difficult to change the programs.  CONTINUED.. Atomicity problems : If any mechanical or electrical types of failure occur to the system, the data should be restored to the consistent state. Atomic means it must happen entirely or not at all. Example: If J wants to transfer Rs2000 from his account to S. If a system failure occur during execution of the program, that Rs2000 is removed from J but not credited to account S, resulting in an inconsistent state. To stay in consistent state either both credit and debit occur, or that neither occur.  CONTINUED.. CUSTOMER_SAVING Account_number Name Age Balance Address 123469 Suri 26 12000 #35,hassan 123468 Mohan 27 15000 #23,Bangalore 123567 Jagadish 28 18000 #323,Bangalore Figure1.4 Atomicity problems inconsistent state Concurrent access anomalies : System allows multiple users to update, delete and retrieve the data simultaneously. If two programs run concurrently, they may both read the value, and write back the value. Depending on which one writes the value last, that value maybe correct or incorrect value. Example: If two customers withdraw amount from J (say Rs200 and Rs300 respectively) at the same time, the result of concurrent executions may leave the account in an incorrect state. Security problem : Not every user of the database system should be able to access all the data. Example: In a student database system, updating marks is allowed only for lecturer, only viewing the data for student and restricted for updating the data. CONTINUED.. Each application programmer must maintain their own data/ program code Each application program needs to include code for the metadata of each file Each application program must have its own processing routines for reading, inserting, updating and deleting data Lack of coordination and central control Non -standard file formats PROGRAM -DATA DEPENDENCE Limited Data Sharing No centralized control of data Programs are written in different languages, and so cannot easily access each others files. Lengthy Development Times Programmers must design their own file formats Excessive Program Maintenance 80% of of information systems budget Vulnerable to Inconsistency Change in one table need changes in corresponding tables as well otherwise data will be inconsistent CONTINUED.. 1.Self-describing nature of a database system 2.Insulation between programs and data, and data abstraction 3.Support of multiple views of the data 4.Sharing of data and multiuser transaction processing MAIN CHARACTERISTICS OF THE DATABASE APPROACH VERSUS THE FILE PROCESSING Self-describing nature of a database system: A DBMS catalog stores the description of a particular database (e.g. data structures, types, and constraints) The description is called meta -data. This allows the DBMS software to work with different database applications. Insulation between programs and data: Called program -data independence . Allows changing data structures and storage organization without having to change the DBMS access programs. CONTINUE.. RELATIONS Relation_name No_of_columns EMPLOYEE 5 DEPARTMENT 3 PROJECT 3 DEPENDENT 4 (a) COLUMNS Column_name Data_type Belongs_to_relaiton SSN Character(10) EMPLOYEE Name Character(10) EMPLOYEE Age Integer EMPLOYEE Address Character(30) EMPLOYE E Salary Decimal(10,2) EMPLOYEE Dname Character(10) DEPARTMENT Dnumber Character(10) DEPARTMENT Dlocation Character(30) DEPARTMENT Pname Character(10) PROJECT .. .. ..  .. . (b) An example of a database catalog for the database in figure (a) Example: To add a new field Birthdate to Employee records, we only need to change the description of Employee records in the catalog; no change in the programs. Data Item Name Starting Position in Record Length in characters (bytes) SSN 1 10 Name 11 10 Age 21 1 Address 22 30 Salary 52 10,2 internal storage for EMPLOYEE record, based on the database catalog in Figure (a) In object -oriented and object -relational systems, users can define operations on data as part of the database definitions.  An operation (also called a function or method) is specified in two parts. The interface (or signature) of an operation includes the operation name and the data types of its arguments (or parameters). The implementation (or method) of the operation is specified separately and can be changed without affecting the interface . User application programs can operate on the data by invoking these operations through their names and arguments, regardless of how the operations are implemented. This may be termed program -operation independence PROGRAM -OPERATION INDEPENDENCE The characteristic that allows program -data independence and program -operation independence is called data abstraction . A data model is used to hide storage and implementation details and also present the users with a conceptual view of the database . DATA ABSTRACTION Each user may see a different view of the database, which describes only the data of interest to that user. SUPPORT OF MULTIPLE VIEWS OF THE DATA (a) EMPLOYEE SSN Name 123467 Aruna 123469 Sita 123468 Sai 123567 Babu (b)EMPLOYEE SSN Name Dno 123467 Aruna 5 123567 Babu 5 Example: One user is interested in accessing and printing the specified employee field details. A second user, who is interested in checking salary details of employee who work in department 5. It allows multiple users to retrieve and to update the database at the same time . Concurrency control within the DBMS guarantees that each transaction is correctly executed or completely aborted . OLTP (Online Transaction Processing) is a major part of database applications This allows hundreds of concurrent transactions to execute per second. Example : Any online booking DB system when multiuser accesses the information about the seat details of the flight and reserve a seat on an airline reservation database system ensure that each seat can be accessed by only one user at a time. The DBMS software ensures that concurrent transactions operate correctly and efficiently. SHARING OF DATA AND MULTIUSER TRANSACTION PROCESSING : THE CONCEPT OF A SHARED ORGANIZATIONAL DATABASE Accounting Accounts Payable Accounts Receivable Management Control Planning Manufacturing Production Scheduling Marketing Product Development Sales Corporate Database Controlling redundancy in data storage and in development and maintenance efforts. Sharing of data among multiple users. Restricting unauthorized access to data. Providing persistent storage for program Objects In Object -oriented DBMSs Example: Programming languages like Pascal, java or C++ the values of program variables are discarded/lost once a program terminates, till programmer explicitly stores them in permanent files. Providing Storage Structures (e.g. indexes) for efficient Query Processing ADVANTAGES OF USING THE DATABASE APPROACH Providing backup and recovery services. Providing multiple interfaces to different classes of users. Representing complex relationships among data. Enforcing integrity constraints on the database. Drawing inferences and actions from the stored data using deductive and active rules CONTINUED.. Potential for enforcing standards: This is very crucial for the success of database applications in large organizations . The database permits the DBA to define and enforce standards among database users.  Standards refer to data item names, display formats, screens, report structures, meta -data (description of data), Web page layouts, etc. Reduced application development time: Once a database is up and running, substantially less time is generally required to create new applications using DBMS facilities. Incremental time to add each new application is reduced. ADDITIONAL IMPLICATIONS OF USING THE DATABASE APPROACH Flexibility to change data structures: Database structure can be changed as per the requirements change without affecting the stored data and the existing application programs. Availability of current/ Up -to-Date Information: Extremely important for on -line transaction systems such as airline, hotel, car reservations . As soon as one users update is applied to the database, all other users can immediately see this update. Economies of scale : Makes the organization profitable by combining many application & data. Wasteful overlap of resources and personnel can be avoided by consolidating data and applications across departments CONTINUED.. Main inhibitors (costs) of using a DBMS: High initial investment and possible need for additional hardware. Overhead for providing generality, security, concurrency control, recovery, and integrity functions. When a DBMS may be unnecessary: If the database and applications are simple, well defined, and not expected to change. If there are stringent real -time requirements that may not be met because of DBMS overhead. If access to data by multiple users is not required. WHEN NOT TO USE A DBMS When no DBMS may suffice: If the database system is not able to handle the complexity of data because of modeling limitations If the database users need special operations not supported by the DBMS. CONTINUED.. Complexity Size Cost Software Hardware Conversion Performance Vulnerability LIMITATIONS OF DBMS Model A model is described by the schema which is held in the data dictionary. A structure that demonstrates all the required features of the parts of the real world which is of interest to the users of the information in the model. Representation and reflection of the real world (Universe of Discourse ) Data Model A data model is a collection of concepts for describing data . It describe structure of a database: the data types, relationships, constraints, semantics and operational behavior. It is a tool for data abstraction Database Schema : The description of a database is called database schema, which is specified during database design and is not expected to change frequently.  DEFINE MODEL, DATA MODEL AND SCHEME Schema: Students( sid text , name text, login text, age integer, gpa float)  Courses( cid text , cname text, credits integer)  Enrolled( sid text , cid text , grade text ) UNIVERSITY DB Student(studno,name,address) Course(courseno,lecturer) Schema Student(123,Bloggs,Woolton) Course(321,Jones,Owens) Instance Student(studno,name,address) Course(courseno,lecturer) Schema Student(123,Bloggs,Woolton) Course(321,Jones,Owens) Instance A schema is a description of a particular collection of data, using a given data model. Database state : The data in the database at a particular moment in time is called a database. state or snapshot . It is also called the current set of occurrences or instances in the database. Empty state : The database with no data is called empty state. Initial state : when the database is first populated or loaded with the initial data. Current state : At any point in time, the database has a current state. Valid state : A state that satisfies the structure and constraints specified in the schema. Invalid state : If a state that do not satisfies the structure and constraints specified in the schema. The schema is sometimes called the intension , and a database state is called an extension of the schema. DEFINE THE TERM SCHEME DIAGRAM Example : FLIGHT -SCHEDULE FLIGHT# AIRLINE WEEKDA Y PRICE DEPT -AIRPORT FLIGHT# AIRPORT -CODE Figure1.16: Schema diagram Schema Diagram : A displayed schema is called a Schema diagram EXAMPLE PROGRAM 1: INSURANCE DATABASE Consider the Insurance database given below . The primary keys are underlined and the data types are specified . PERSON (driver -id #: String, name : String, address : String) CAR (Regno : String, model : String, year: int) ACCIDENT (report -number : int, date: date, location : String) OWNS (driver -id #: String, Regno : String) PARTICIPATED (driver -id: String, Regno : String, report -number : int, damage -amount : int) A Data Model in Database Management System (DBMS) is the concept of tools that are developed to summarize the description of the database. Data Models provide us with a transparent picture of data which helps us in creating an actual database. It shows us from the design of the data to its proper implementation of data . Types of Relational Models 1.Conceptual Data Model 2.Representational Data Model 3.Physical Data Model DATA MODELS IN DBMS High -level or Conceptual data models : It used to describes the structure of the database (based on entities, attributes and relationships ). Entity : It represents a real world object such as an employee or a project. Attributes : It represents some property of interest that describes an entity, such as the employees name or salary. Relationship : A relationship among the two or more entities represents an association among two or more entities. Example: a work -on relationship between an employee and a project CATEGORIES OF DATA MODELS A low -level or physical data model : It used to describes the details of how data is stored in the computer. These concepts generally meant for computer specialists, not for typical end users . Representational or implementation data models: It is between the high level or low level data models, which provides concepts that is understood by end user and also the way data is organized by within the computer .  It hides some details of data storage but can be implemented on a computer system directly (record -based, object oriented). CONTINUED.. Relational Model Network Model Hierarchical Model Object Oriented Model Semantic Data Model SOME OTHER DATA MODELS Relational model was originally introduced in 1970, was heavily researched and experimented within IBM Research and several universities. Relational DBMS Products emerged in the early 1980s. It uses a collection of tables to represent both data and the relationship among those data. Each table has multiple columns and each column has unique name . Commercial systems include: ORACLE, DB2, SYBASE, INFORMIX, INGRES, SQL Server Relational Model - Data Structures domains attributes relations RELATIONAL MODEL Relation name flight -schedule flight#:integer airline:char(20) weekday:char(2) price:dec(6,2) Attribute names domain names ADVANTAGES: Data represent in a Simplified format. Manipulating record is simple with the use of key attributes. Representation of different types of relationship is possible with this model. Operations  Powerful set-oriented query languages Relational Algebra: procedural; describes how to compute a query; operators like JOIN, SELECT, PROJECT Relational Calculus: declarative; describes the desired result, e.g. SQL, QBE Insert, delete, and update capabilities CONTINUED.. It is the type of database that stores data in the form of parent -children relationship nodes. Here, it organizes data in a tree -like structure . It used to create a relationship b/n two units(1:N). Commercial systems include IBMs IMS, MRIs System -2000 (now sold by SAS), and CDCs MARS IV. HIERARCHICAL MODEL The collections of records, and relationships, among data are represented by links. Which can viewed as pointers. Or The network model allows any unit to be related to other unit through fixed relationship(M:N). Based on the CODASYL -DBTG 1971 report. Commercial systems include, CA -IDMS and DMS -1100 NETWORK MODEL The data and their relationships are contained in a single structure. In this, real -world problems are represented as objects with different attributes. All objects have multiple relationships between them. It is a combination of Object Oriented programming and a Relational Database Model. e.g., Simula , Smalltalk, C++, Java Example: class flight -schedule { type tuple (flight#: integer, weekdays: set ( weekday: enumeration { mo,tu,we,th,fr,sa,su }) dept -airport: airport, arriv -airport: airport) method reschedule(new -dept : airport, new -arriv : airport)} OBJECT -ORIENTED DATA MODEL https://www.javatpoint.com/types -of-databases Data on the Web and E -commerce Applications Scientific Applications XML ( eXtensible Markup Language) Image Storage and Management Audio and Video Data Management Data Warehousing and Data Mining Spatial Data Management Time Series and Historical Data Management Three schema Architecture : It is also called ANSI/SPARC architecture or three -level architecture . The framework is used to describe the structure of a specific database system . It used to separate the user applications and physical database . The three schema architecture contains three -levels . It breaks the database down into three different categories . It describes the physical storage structure of the database .  Uses a physical data model and describes the complete details of data storage and access path for the database. The internal schema is also known as a physical schema . Storage space allocations. For Example: B-Trees, Hashing etc. Access paths. For Example: Specification of primary and secondary keys, indexes, pointers and sequencing. Data compression and encryption techniques. Optimization of internal structures. Representation of stored fields. INTERNAL LEVEL HAS AND INTERNAL SCHEMA It describes the structure of the whole database for a community of users. Conceptual level is also known as logical level . Hides the details of physical storage structures and concentrates on describing entities, data types, relationships, user operations, and constraints . Programmers and database administrators work at this level. CONCEPTUAL LEVEL HAS A CONCEPTUAL SCHEMA An external schema/level is also known as view schema . It includes a number of external schemas or user views. At the external level, a database contains several schemas that sometimes called as subschema . The subschema is used to describe the different view of the database. It describes the part of the database that a particular user group is interested in and hides the rest of the database from that user group . . EXTERNAL OR VIEW LEVEL The three levels of DBMS architecture don't exist independently of each other . Mapping is used to transform the request and response between various database levels of architecture . DBMS is responsible for correspondence between the three types of schema . This correspondence is called Mapping . MAPPING BETWEEN VIEWS EXAMPLE: There are basically two types of mapping in the database architecture: Conceptual/ Internal Mapping External / Conceptual Mapping In External / Conceptual mapping , it is necessary to transform the request from external level to conceptual schema . In Conceptual / Internal mapping , DBMS transform the request from the conceptual to internal level . MAPPING BETWEEN VIEWS The three levels of DBMS architecture don't exist independently of each other . Mapping is used to transform the request and response between various database levels of architecture . DBMS is responsible for correspondence between the three types of schema . This correspondence is called Mapping . In External / Conceptual mapping, it is necessary to transform the request from external level to conceptual schema . In Conceptual / Internal mapping, DBMS transform the request from the conceptual to internal level . MAPPING BETWEEN VIEWS The capacity to change the schema at one level of a DB system without change the schema at the next higher level is called data independence .  Two types of data independence: 1. Logical data independence : Change the conceptual schema without having to change the external schemas 2. Physical data independence : Change the internal schema without having to change the conceptual schema DATA INDEPENDENCE A DBMS has appropriate languages and interfaces to express database queries and updates . Database languages can be used to read, store and update the data in the database . DATABASE LANGUAGES AND INTERFACES Structured Query Language(SQL) DBMS packages provide an integrated feature of above languages into a single language called Structured Query Language. Data definition language (DDL), is used by the DBA and by database designers to define both schemas. Storage definition language (SDL), is used to specify the internal schema. View definition language (VDL), to specify user views and their mappings to the conceptual schema. Data manipulation language (DML) provides set of operations like retrieval, insertion, deletion, and modification of the data. DBMS LANGUAGES There are two main types of DMLs. They are High -level or nonprocedural DML Low-level or procedural DML High -level DML: Many DBMSs allow high -level DML statements either to be entered interactively from a display monitor or terminal or to be embedded in a general -purpose programming language.  Retrieve many records in a single DML statement; therefore, they are called set-at-a-time or set -oriented DMLs. A query in a high -level DML often specifies which data to retrieve rather than how to retrieve it; therefore, such languages are also called declarative. DML Low-level or procedural DML: They must be embedded in a general -purpose programming language.  The low -level are also called record -at-a-time because it retrieve only one record or objects at a time from the DB and processes each separately. It use programming language such as lopping, to retrieve and process each record from a set of records. Ex: Hierarchical model is DL/1 uses command like GET UNIQUE, GET NEXT, GET NEXT WITHIN PARENT etc  Whenever DML commands, whether high level or low level, are embedded in general -purpose programming language , that language is called the host language and the DML is called data sublanguage . High -level DML used in a standalone interactive manner is called a query language . DML 1.Menu -Based Interfaces for Web Clients or Browsing. 2.Forms -Based Interfaces displays a form to each user 3.Graphical User Interfaces displays a schema to the user in diagrammatic form 4.Natural Language Interfaces accepts requests written in English or some other language and attempt to understand them. 5.Speech Input and Output Interfaces 6.Interfaces for Parametric Users such as bank tellers, often have a small set of operations that they must perform repeatedly. 7.Interfaces for the Database Administrator (DBA) use privileged commands INTERFACES IN DBMS DATABASE USERS DB USERS Users are differentiated by the way they expect to interact with the system System Analysts  Determine the requirements of end users Database Designers  Identify and Choose appropriate structures to represent and store data Application Programmers  interact with system through DML calls DB USERS END USERS Casual Users uses a sophisticated database query language to specify their requests and are typically middle or high level managers Sophisticated Users form requests in a database query language . Scientists/Engineers Specialized Users write specialized database applications that do not fit into the traditional data processing framework Nave or Parametric Users invoke one of the permanent application programs that have been written previously . Example : people accessing database over the web, bank tellers, clerical staff Standalone Users who maintain personal databases by using ready made program packages that provide easy to use menu or GUI based interfaces DATABASE ADMINISTRATOR (DBA) Coordinates all the activities of the database system has good understanding of the enterprises information resources and needs . Responsible for Managing the resources Database (primary) DBMS (secondary) DBA's duties include : Storage structure and access method definition Schema and physical organization modification Granting users authority to access the database Backing up data Monitoring performance and responding to changes in requirements Database tuning THE DATABASE SYSTEM ENVIRONMENT: DBMS COMPONENT MODULES The figure is divided into two halves . The top half of the figure refers to the various users of the database environment and their interfaces. The lower half shows the internals of the DBMS responsible for storage of data and processing of transaction. 1. Database System Environment a. DBMS Component Modules b. Database System Utilities  Loading  Backup  File Reorganization  Performance Monitoring c. Other Tools  CASE tools  Data Dictionary System  Application Development Environment  Communications Software The DBA staff works on defining the database and tuning it by making changes to its definition using the DDL and other privileged commands. DDL compiler processes schema definitions, specified in the DDL, and stores descriptions of the schemas (meta -data) in the DBMS catalog . Catalog includes information such as the names and sizes of files, names and data types of data items, storage details of each file, mapping information among schemas, and constraints, in addition to many other types of information that are needed by the DBMS modules Casual users and persons with occasional need for information from the database interact using some form of interface, interactive query interface . These queries are parsed, analyzed for correctness of the operations for the model, the name of data elements, and so on by a query compiler that compiles them into an internal form. CONTINUED.. Query optimizer is concerned with rearrangement and possible reordering of operations, elimination of redundancies, and use of correct algorithms and indexes during execution. It consults the system catalog for statistical and other physical information about the stored data and generates executable code that performs the necessary operations for the query and makes calls on the runtime processor. Precompiler extracts DML commands from an application program written in a host programming language. These commands are sent to the DML compiler for compilation into object code for database access. The rest of the programming is sent to the host language compiler. CONTINUED.. In lower half of the figure the runtime database processor is shown to execute 1. The privileged commands, 2. The executable query plans, and 3. The canned transactions with runtime parameters. It works with the system dictionary and may update it with statistics. It works with the stored data manager, for carrying out low - level input/output operations between disk and memory, management of buffers in main memory. Concurrency control and backup and recovery systems separately as module for transaction management. CONTINUED.. Common utilities have the following types of functions: 1.Loading  is used to load existing data files into the database, transferring data from one DBMS to another, loading programs are called conversion tools . 2.Backup  dumping the entire database onto tape, this backup can be used to restore the database. 3.Database storage reorganization  reorganize a set of database files into a different file organization to improve performance. 4.Performance monitoring  monitors database usage and provides information to the DBA 5.Other utilities for sorting files, handling data compression, monitoring access by users, interfacing with the network, and performing other functions DATABASE SYSTEM UTILITIES CASE tools used in design phase of database systems. Data dictionary / data repository is used to store catalog. (Stored information like schema descriptions and other information such as design decisions, application program descriptions, user information, usage standards, etc. Such system called information repository .) Active data dictionary is accessed by DBMS software and users/DBA, Passive data dictionary is accessed by users/DBA only . Application development environment systems provide an environment for developing database applications. .Ex: Jbuilder , PowerBuilder system (It used for database design, GUI development, querying and updating, and application program development) TOOLS, APPLICATION ENVIRONMENTS, AND COMMUNICATIONS FACILITIES Communications software , allow users to remote access database.  These are connected to the database site through data communications hardware such as Internet routers, phone lines, long -haul networks, local networks, or satellite communication devices  The integrated DBMS and data communications system is called a DB/DC system CONITNUED ..",
        "module_number": 1,
        "description": "Module covering DATABASE MANAGEMENT SYSTEMS Introduction to Databases: Introduction, An Example, Characteristics of Database approach, Advantages of using DBMS approach, When not to use a DBMS Database System Concepts and Architecture: Data models, Schemas and instances, Three schema architecture and data independence Database languages and interfaces, The database system environment, SQL: SQL Data Definition and Data Types specifying basic constraints in SQL, Basic retrieval queries in SQL, Insert, Delete and Update statements in SQL, Additional features of SQL, More complex SQL Queries, Specifying Constraints as Assertions and Triggers, Views (Virtual Tables) in SQL, Schema Change Statement in SQL. CONTENTS An example of data is a students test score Ex: The average score of a class is the information derived from the given data. Data means recorded facts or Known facts that have implicit (unquestioned) meaning are stored on computer media. Facts, figures, statistics etc. having no particular meaning. The Data can be: Structured : numbers, text, dates Unstructured: images, video, documents Example :( USN,name.age ) a)1,Ramu, 19 b)23,Suma,20 WHAT IS DATA? Information : data processed to increase knowledge in the person using the data Metadata / System catalog : data that describes the properties or characteristics of the data, including data types, field sizes, allowable values, and data context user data. CONTINUED..  A database is a collection of related data or information, which stores data in form of table. A Database: collection of interrelated data + description of data WHAT IS DATABASE ? information, which stores data in form of table. Fields Table Name : EMPLOYEE SSN Name Age Address Dno Salary 123467 Aruna 25 #45,Bangalore 5 20000 123469 Suri 26 #35,hassan 4 12000 123468 Mohan 27 #23,Bangalore 1 15000 123567 Jagadish 28 Null 5 20000 Table Name : DEPARTMENT Dname Dnumber Dlocation Research 5 Bangalore Administration 4 Bangalore Headquarters 1 Bombay Fig :A database that s tores employee and department information Record s Def 1: Database is an organized collection of logically related data Def 2: A database is a shared collection of logically related data that is stored to meet the requirements of different users of an organization Def 3: A database is a self-describing collection of integrated records Def 4: A database models a particular real world system in the computer in the form of data DEFINITIONS OF DATABASE Database System A database system is a software system, which supports the definition and use of a database DDL: Data Definition Language DML: Data Manipulation Language WHAT IS DB SYSTEM? A DBMS is a collection of interrelated files and set of programs that allow users to access and modify these files. or A DBMS is a collection of programs that enables the users to create & maintain a database. DBMS is general -purpose software that facilitates the process of defining, constructing, manipulating and sharing database among various users and applications. DATABASE MANAGEMENT SYSTEM (DBMS) A Database Management System (DBMS) is: A software system designed to store, manage, and facilitate access to databases. The primary goal of a DBMS is to provide a way to store and retrieve database information that is both convenient and efficient . The DBMS Functionality Defining a Database: It involves the specifying types of data types, structures and constraints of the data to be stored in the database. Constructing a Database: The process of storing the database on a secondary storage medium . DATABASE MANAGEMENT SYSTEM (DBMS) Manipulating a Database: It includes functions for querying (retrieve specific data), updating, reporting, insertions, deletions and modifications to its content. Concurrent processing and sharing by a set of users and programs  yet, keeping all data valid and consistent. Other features : Protecting the Database : It involves the two types of protection i.e. system protection against hardware/software (crashes) and security protection against unauthorized access. Maintaining the Database : Maintain the database over long period of time . Examples : Access, Oracle, MySQLServer , dBase, Sybase, Clipper, MySQL, PostgreSQL , Apache Derby, SQLite , Ingres, etc. CONTINUE.. SIMPLIFIED DATABASE SYSTEM ENVIRONMENT  Traditional Database applications : The information stored and accessed in computer either numeric or textual pattern ..  Multimedia Databases : Store picture, video clips and sound message. Geographic Information Systems (GIS) : It can store and analysis maps, weather data and satellite images. Data Warehouses and online analytical processing (OLAP) : This is used for decision making Real -time and Active Databases : It can be used in controlling industrial and manufacturing processes. Database Search Technique: Used in World Wide Web (www) to improve the search for information that is needed for browsing in the internet . Mobile databases DIFFERENT TYPES OF DBMS  DATABASE APPLICATIONS Data can be stored in RAM this is what every programming language offers! RAM is fast, and random access Isnt this heaven? Every OS includes a File System manages files on a magnetic disk allows open, read, seek, close on a file allows protections to be set on a file drawbacks relative to RAM? File processing system was the earliest storage type database system. In file processing system the permanent records are stored in various files, and different application programs are written to extract records from, and to add records to appropriate files. Each program defines and manages its own data . FILE PROCESSING SYSTEM VERSUS A DBMS Program and Data Interdependence Uncontrolled redundancy( The same data stored in multiple places ) Inconsistent data( Incorrectness in data entry) Inflexibility Difficulty in accessing data Data isolation Integrity problems Atomicity problems Concurrent access anomalies Security problem Limited data sharing Poor enforcement of standards Low programmer productivity Excessive program maintenance Excessive data maintenance THE FILE SYSTEM HAS SOME DISADVANTAGE Same data is held by different programs. Different systems/programs have separate copies of the same data The different values and/or different formats for the same item. Waste of space to have duplicate data Causes more maintenance headaches The biggest problem : When data changes in one file, could cause inconsistencies (Vulnerable to Inconsistency) Compromises data integrity (data reliability) DUPLICATION OF DATA (DATA REDUNDANCY)  Incorrectness in data entry . Example: A changes made in customer address in savings -account records will be reflected but not in other files of banking system this makes the data inconsistency.  INCONSISTENCY DATA CUSTOMER_SAVING Account_number Name Age Balance Address 123467 Aruna 25 20000 #45,Bangalore 123469 Suri 26 12000 #35,hassan 123468 Mohan 27 15000 #23,Bangalore 123567 Jagadish 28 20000 #323,Bangalore 123467 Arun 25 20000 #45,Bangalore Spelling Mistake in name field CHECKING_ACCOUNT Account_number Name Address 123467 Aruna #45,Bangalore 123469 Suri #35,hassan 123468 Mohan #23,Bangalore 123567 Jagadish Null Changes not reflected Inflexibility : If any necessary changes like adding a file or extend the data elements in an existing file the entire file has to be changed. This makes the affecting the stored data and the existing applications programs. Example: In student table need to add email id to existing DB.  CONTINUED.. USN Name Age Address 123467 Aruna 25 #45,Bangalore 123469 Suri 26 #35,hassan STUDENT Difficulty in accessing data : If requested query is not designed for original system. Then check the particular file to get the requested information manually or ask the system programmer to write the needed application program. Example: If bank officers needs to find out the names of all customers who live within a particular postal -code area in a citys . There is no application program on hand to meet it in the original system. The file -processing systems do not allow needed data to be retrieved in a convenient and efficient manner. CONTINUED.. Data isolation : The data are scattered in various files, and files may be different formats, it is difficult to write new application programs to retrieve the appropriate data.  Integrity problems : The data values stored in the database must satisfy certain types of consistency constraints. Example: The balance of a bank account may never fall below Rs.500 . Developers enforce these constraints in the system by adding code in the various application programs. If new constraints wanted to add, it is difficult to change the programs.  CONTINUED.. Atomicity problems : If any mechanical or electrical types of failure occur to the system, the data should be restored to the consistent state. Atomic means it must happen entirely or not at all. Example: If J wants to transfer Rs2000 from his account to S. If a system failure occur during execution of the program, that Rs2000 is removed from J but not credited to account S, resulting in an inconsistent state. To stay in consistent state either both credit and debit occur, or that neither occur.  CONTINUED.. CUSTOMER_SAVING Account_number Name Age Balance Address 123469 Suri 26 12000 #35,hassan 123468 Mohan 27 15000 #23,Bangalore 123567 Jagadish 28 18000 #323,Bangalore Figure1.4 Atomicity problems inconsistent state Concurrent access anomalies : System allows multiple users to update, delete and retrieve the data simultaneously. If two programs run concurrently, they may both read the value, and write back the value. Depending on which one writes the value last, that value maybe correct or incorrect value. Example: If two customers withdraw amount from J (say Rs200 and Rs300 respectively) at the same time, the result of concurrent executions may leave the account in an incorrect state. Security problem : Not every user of the database system should be able to access all the data. Example: In a student database system, updating marks is allowed only for lecturer, only viewing the data for student and restricted for updating the data. CONTINUED.. Each application programmer must maintain their own data/ program code Each application program needs to include code for the metadata of each file Each application program must have its own processing routines for reading, inserting, updating and deleting data Lack of coordination and central control Non -standard file formats PROGRAM -DATA DEPENDENCE Limited Data Sharing No centralized control of data Programs are written in different languages, and so cannot easily access each others files. Lengthy Development Times Programmers must design their own file formats Excessive Program Maintenance 80% of of information systems budget Vulnerable to Inconsistency Change in one table need changes in corresponding tables as well otherwise data will be inconsistent CONTINUED.. 1.Self-describing nature of a database system 2.Insulation between programs and data, and data abstraction 3.Support of multiple views of the data 4.Sharing of data and multiuser transaction processing MAIN CHARACTERISTICS OF THE DATABASE APPROACH VERSUS THE FILE PROCESSING Self-describing nature of a database system: A DBMS catalog stores the description of a particular database (e.g. data structures, types, and constraints) The description is called meta -data. This allows the DBMS software to work with different database applications. Insulation between programs and data: Called program -data independence . Allows changing data structures and storage organization without having to change the DBMS access programs. CONTINUE.. RELATIONS Relation_name No_of_columns EMPLOYEE 5 DEPARTMENT 3 PROJECT 3 DEPENDENT 4 (a) COLUMNS Column_name Data_type Belongs_to_relaiton SSN Character(10) EMPLOYEE Name Character(10) EMPLOYEE Age Integer EMPLOYEE Address Character(30) EMPLOYE E Salary Decimal(10,2) EMPLOYEE Dname Character(10) DEPARTMENT Dnumber Character(10) DEPARTMENT Dlocation Character(30) DEPARTMENT Pname Character(10) PROJECT .. .. ..  .. . (b) An example of a database catalog for the database in figure (a) Example: To add a new field Birthdate to Employee records, we only need to change the description of Employee records in the catalog; no change in the programs. Data Item Name Starting Position in Record Length in characters (bytes) SSN 1 10 Name 11 10 Age 21 1 Address 22 30 Salary 52 10,2 internal storage for EMPLOYEE record, based on the database catalog in Figure (a) In object -oriented and object -relational systems, users can define operations on data as part of the database definitions.  An operation (also called a function or method) is specified in two parts. The interface (or signature) of an operation includes the operation name and the data types of its arguments (or parameters). The implementation (or method) of the operation is specified separately and can be changed without affecting the interface . User application programs can operate on the data by invoking these operations through their names and arguments, regardless of how the operations are implemented. This may be termed program -operation independence PROGRAM -OPERATION INDEPENDENCE The characteristic that allows program -data independence and program -operation independence is called data abstraction . A data model is used to hide storage and implementation details and also present the users with a conceptual view of the database . DATA ABSTRACTION Each user may see a different view of the database, which describes only the data of interest to that user. SUPPORT OF MULTIPLE VIEWS OF THE DATA (a) EMPLOYEE SSN Name 123467 Aruna 123469 Sita 123468 Sai 123567 Babu (b)EMPLOYEE SSN Name Dno 123467 Aruna 5 123567 Babu 5 Example: One user is interested in accessing and printing the specified employee field details. A second user, who is interested in checking salary details of employee who work in department 5. It allows multiple users to retrieve and to update the database at the same time . Concurrency control within the DBMS guarantees that each transaction is correctly executed or completely aborted . OLTP (Online Transaction Processing) is a major part of database applications This allows hundreds of concurrent transactions to execute per second. Example : Any online booking DB system when multiuser accesses the information about the seat details of the flight and reserve a seat on an airline reservation database system ensure that each seat can be accessed by only one user at a time. The DBMS software ensures that concurrent transactions operate correctly and efficiently. SHARING OF DATA AND MULTIUSER TRANSACTION PROCESSING : THE CONCEPT OF A SHARED ORGANIZATIONAL DATABASE Accounting Accounts Payable Accounts Receivable Management Control Planning Manufacturing Production Scheduling Marketing Product Development Sales Corporate Database Controlling redundancy in data storage and in development and maintenance efforts. Sharing of data among multiple users. Restricting unauthorized access to data. Providing persistent storage for program Objects In Object -oriented DBMSs Example: Programming languages like Pascal, java or C++ the values of program variables are discarded/lost once a program terminates, till programmer explicitly stores them in permanent files. Providing Storage Structures (e.g. indexes) for efficient Query Processing ADVANTAGES OF USING THE DATABASE APPROACH Providing backup and recovery services. Providing multiple interfaces to different classes of users. Representing complex relationships among data. Enforcing integrity constraints on the database. Drawing inferences and actions from the stored data using deductive and active rules CONTINUED.. Potential for enforcing standards: This is very crucial for the success of database applications in large organizations . The database permits the DBA to define and enforce standards among database users.  Standards refer to data item names, display formats, screens, report structures, meta -data (description of data), Web page layouts, etc. Reduced application development time: Once a database is up and running, substantially less time is generally required to create new applications using DBMS facilities. Incremental time to add each new application is reduced. ADDITIONAL IMPLICATIONS OF USING THE DATABASE APPROACH Flexibility to change data structures: Database structure can be changed as per the requirements change without affecting the stored data and the existing application programs. Availability of current/ Up -to-Date Information: Extremely important for on -line transaction systems such as airline, hotel, car reservations . As soon as one users update is applied to the database, all other users can immediately see this update. Economies of scale : Makes the organization profitable by combining many application & data. Wasteful overlap of resources and personnel can be avoided by consolidating data and applications across departments CONTINUED.. Main inhibitors (costs) of using a DBMS: High initial investment and possible need for additional hardware. Overhead for providing generality, security, concurrency control, recovery, and integrity functions. When a DBMS may be unnecessary: If the database and applications are simple, well defined, and not expected to change. If there are stringent real -time requirements that may not be met because of DBMS overhead. If access to data by multiple users is not required. WHEN NOT TO USE A DBMS When no DBMS may suffice: If the database system is not able to handle the complexity of data because of modeling limitations If the database users need special operations not supported by the DBMS. CONTINUED.. Complexity Size Cost Software Hardware Conversion Performance Vulnerability LIMITATIONS OF DBMS Model A model is described by the schema which is held in the data dictionary. A structure that demonstrates all the required features of the parts of the real world which is of interest to the users of the information in the model. Representation and reflection of the real world (Universe of Discourse ) Data Model A data model is a collection of concepts for describing data . It describe structure of a database: the data types, relationships, constraints, semantics and operational behavior. It is a tool for data abstraction Database Schema : The description of a database is called database schema, which is specified during database design and is not expected to change frequently.  DEFINE MODEL, DATA MODEL AND SCHEME Schema: Students( sid text , name text, login text, age integer, gpa float)  Courses( cid text , cname text, credits integer)  Enrolled( sid text , cid text , grade text ) UNIVERSITY DB Student(studno,name,address) Course(courseno,lecturer) Schema Student(123,Bloggs,Woolton) Course(321,Jones,Owens) Instance Student(studno,name,address) Course(courseno,lecturer) Schema Student(123,Bloggs,Woolton) Course(321,Jones,Owens) Instance A schema is a description of a particular collection of data, using a given data model. Database state : The data in the database at a particular moment in time is called a database. state or snapshot . It is also called the current set of occurrences or instances in the database. Empty state : The database with no data is called empty state. Initial state : when the database is first populated or loaded with the initial data. Current state : At any point in time, the database has a current state. Valid state : A state that satisfies the structure and constraints specified in the schema. Invalid state : If a state that do not satisfies the structure and constraints specified in the schema. The schema is sometimes called the intension , and a database state is called an extension of the schema. DEFINE THE TERM SCHEME DIAGRAM Example : FLIGHT -SCHEDULE FLIGHT# AIRLINE WEEKDA Y PRICE DEPT -AIRPORT FLIGHT# AIRPORT -CODE Figure1.16: Schema diagram Schema Diagram : A displayed schema is called a Schema diagram EXAMPLE PROGRAM 1: INSURANCE DATABASE Consider the Insurance database given below . The primary keys are underlined and the data types are specified . PERSON (driver -id #: String, name : String, address : String) CAR (Regno : String, model : String, year: int) ACCIDENT (report -number : int, date: date, location : String) OWNS (driver -id #: String, Regno : String) PARTICIPATED (driver -id: String, Regno : String, report -number : int, damage -amount : int) A Data Model in Database Management System (DBMS) is the concept of tools that are developed to summarize the description of the database. Data Models provide us with a transparent picture of data which helps us in creating an actual database. It shows us from the design of the data to its proper implementation of data . Types of Relational Models 1.Conceptual Data Model 2.Representational Data Model 3.Physical Data Model DATA MODELS IN DBMS High -level or Conceptual data models : It used to describes the structure of the database (based on entities, attributes and relationships ). Entity : It represents a real world object such as an employee or a project. Attributes : It represents some property of interest that describes an entity, such as the employees name or salary. Relationship : A relationship among the two or more entities represents an association among two or more entities. Example: a work -on relationship between an employee and a project CATEGORIES OF DATA MODELS A low -level or physical data model : It used to describes the details of how data is stored in the computer. These concepts generally meant for computer specialists, not for typical end users . Representational or implementation data models: It is between the high level or low level data models, which provides concepts that is understood by end user and also the way data is organized by within the computer .  It hides some details of data storage but can be implemented on a computer system directly (record -based, object oriented). CONTINUED.. Relational Model Network Model Hierarchical Model Object Oriented Model Semantic Data Model SOME OTHER DATA MODELS Relational model was originally introduced in 1970, was heavily researched and experimented within IBM Research and several universities. Relational DBMS Products emerged in the early 1980s. It uses a collection of tables to represent both data and the relationship among those data. Each table has multiple columns and each column has unique name . Commercial systems include: ORACLE, DB2, SYBASE, INFORMIX, INGRES, SQL Server Relational Model - Data Structures domains attributes relations RELATIONAL MODEL Relation name flight -schedule flight#:integer airline:char(20) weekday:char(2) price:dec(6,2) Attribute names domain names ADVANTAGES: Data represent in a Simplified format. Manipulating record is simple with the use of key attributes. Representation of different types of relationship is possible with this model. Operations  Powerful set-oriented query languages Relational Algebra: procedural; describes how to compute a query; operators like JOIN, SELECT, PROJECT Relational Calculus: declarative; describes the desired result, e.g. SQL, QBE Insert, delete, and update capabilities CONTINUED.. It is the type of database that stores data in the form of parent -children relationship nodes. Here, it organizes data in a tree -like structure . It used to create a relationship b/n two units(1:N). Commercial systems include IBMs IMS, MRIs System -2000 (now sold by SAS), and CDCs MARS IV. HIERARCHICAL MODEL The collections of records, and relationships, among data are represented by links. Which can viewed as pointers. Or The network model allows any unit to be related to other unit through fixed relationship(M:N). Based on the CODASYL -DBTG 1971 report. Commercial systems include, CA -IDMS and DMS -1100 NETWORK MODEL The data and their relationships are contained in a single structure. In this, real -world problems are represented as objects with different attributes. All objects have multiple relationships between them. It is a combination of Object Oriented programming and a Relational Database Model. e.g., Simula , Smalltalk, C++, Java Example: class flight -schedule { type tuple (flight#: integer, weekdays: set ( weekday: enumeration { mo,tu,we,th,fr,sa,su }) dept -airport: airport, arriv -airport: airport) method reschedule(new -dept : airport, new -arriv : airport)} OBJECT -ORIENTED DATA MODEL https://www.javatpoint.com/types -of-databases Data on the Web and E -commerce Applications Scientific Applications XML ( eXtensible Markup Language) Image Storage and Management Audio and Video Data Management Data Warehousing and Data Mining Spatial Data Management Time Series and Historical Data Management Three schema Architecture : It is also called ANSI/SPARC architecture or three -level architecture . The framework is used to describe the structure of a specific database system . It used to separate the user applications and physical database . The three schema architecture contains three -levels . It breaks the database down into three different categories . It describes the physical storage structure of the database .  Uses a physical data model and describes the complete details of data storage and access path for the database. The internal schema is also known as a physical schema . Storage space allocations. For Example: B-Trees, Hashing etc. Access paths. For Example: Specification of primary and secondary keys, indexes, pointers and sequencing. Data compression and encryption techniques. Optimization of internal structures. Representation of stored fields. INTERNAL LEVEL HAS AND INTERNAL SCHEMA It describes the structure of the whole database for a community of users. Conceptual level is also known as logical level . Hides the details of physical storage structures and concentrates on describing entities, data types, relationships, user operations, and constraints . Programmers and database administrators work at this level. CONCEPTUAL LEVEL HAS A CONCEPTUAL SCHEMA An external schema/level is also known as view schema . It includes a number of external schemas or user views. At the external level, a database contains several schemas that sometimes called as subschema . The subschema is used to describe the different view of the database. It describes the part of the database that a particular user group is interested in and hides the rest of the database from that user group . . EXTERNAL OR VIEW LEVEL The three levels of DBMS architecture don't exist independently of each other . Mapping is used to transform the request and response between various database levels of architecture . DBMS is responsible for correspondence between the three types of schema . This correspondence is called Mapping . MAPPING BETWEEN VIEWS EXAMPLE: There are basically two types of mapping in the database architecture: Conceptual/ Internal Mapping External / Conceptual Mapping In External / Conceptual mapping , it is necessary to transform the request from external level to conceptual schema . In Conceptual / Internal mapping , DBMS transform the request from the conceptual to internal level . MAPPING BETWEEN VIEWS The three levels of DBMS architecture don't exist independently of each other . Mapping is used to transform the request and response between various database levels of architecture . DBMS is responsible for correspondence between the three types of schema . This correspondence is called Mapping . In External / Conceptual mapping, it is necessary to transform the request from external level to conceptual schema . In Conceptual / Internal mapping, DBMS transform the request from the conceptual to internal level . MAPPING BETWEEN VIEWS The capacity to change the schema at one level of a DB system without change the schema at the next higher level is called data independence .  Two types of data independence: 1. Logical data independence : Change the conceptual schema without having to change the external schemas 2. Physical data independence : Change the internal schema without having to change the conceptual schema DATA INDEPENDENCE A DBMS has appropriate languages and interfaces to express database queries and updates . Database languages can be used to read, store and update the data in the database . DATABASE LANGUAGES AND INTERFACES Structured Query Language(SQL) DBMS packages provide an integrated feature of above languages into a single language called Structured Query Language. Data definition language (DDL), is used by the DBA and by database designers to define both schemas. Storage definition language (SDL), is used to specify the internal schema. View definition language (VDL), to specify user views and their mappings to the conceptual schema. Data manipulation language (DML) provides set of operations like retrieval, insertion, deletion, and modification of the data. DBMS LANGUAGES There are two main types of DMLs. They are High -level or nonprocedural DML Low-level or procedural DML High -level DML: Many DBMSs allow high -level DML statements either to be entered interactively from a display monitor or terminal or to be embedded in a general -purpose programming language.  Retrieve many records in a single DML statement; therefore, they are called set-at-a-time or set -oriented DMLs. A query in a high -level DML often specifies which data to retrieve rather than how to retrieve it; therefore, such languages are also called declarative. DML Low-level or procedural DML: They must be embedded in a general -purpose programming language.  The low -level are also called record -at-a-time because it retrieve only one record or objects at a time from the DB and processes each separately. It use programming language such as lopping, to retrieve and process each record from a set of records. Ex: Hierarchical model is DL/1 uses command like GET UNIQUE, GET NEXT, GET NEXT WITHIN PARENT etc  Whenever DML commands, whether high level or low level, are embedded in general -purpose programming language , that language is called the host language and the DML is called data sublanguage . High -level DML used in a standalone interactive manner is called a query language . DML 1.Menu -Based Interfaces for Web Clients or Browsing. 2.Forms -Based Interfaces displays a form to each user 3.Graphical User Interfaces displays a schema to the user in diagrammatic form 4.Natural Language Interfaces accepts requests written in English or some other language and attempt to understand them. 5.Speech Input and Output Interfaces 6.Interfaces for Parametric Users such as bank tellers, often have a small set of operations that they must perform repeatedly. 7.Interfaces for the Database Administrator (DBA) use privileged commands INTERFACES IN DBMS DATABASE USERS DB USERS Users are differentiated by the way they expect to interact with the system System Analysts  Determine the requirements of end users Database Designers  Identify and Choose appropriate structures to represent and store data Application Programmers  interact with system through DML calls DB USERS END USERS Casual Users uses a sophisticated database query language to specify their requests and are typically middle or high level managers Sophisticated Users form requests in a database query language . Scientists/Engineers Specialized Users write specialized database applications that do not fit into the traditional data processing framework Nave or Parametric Users invoke one of the permanent application programs that have been written previously . Example : people accessing database over the web, bank tellers, clerical staff Standalone Users who maintain personal databases by using ready made program packages that provide easy to use menu or GUI based interfaces DATABASE ADMINISTRATOR (DBA) Coordinates all the activities of the database system has good understanding of the enterprises information resources and needs . Responsible for Managing the resources Database (primary) DBMS (secondary) DBA's duties include : Storage structure and access method definition Schema and physical organization modification Granting users authority to access the database Backing up data Monitoring performance and responding to changes in requirements Database tuning THE DATABASE SYSTEM ENVIRONMENT: DBMS COMPONENT MODULES The figure is divided into two halves . The top half of the figure refers to the various users of the database environment and their interfaces. The lower half shows the internals of the DBMS responsible for storage of data and processing of transaction. 1. Database System Environment a. DBMS Component Modules b. Database System Utilities  Loading  Backup  File Reorganization  Performance Monitoring c. Other Tools  CASE tools  Data Dictionary System  Application Development Environment  Communications Software The DBA staff works on defining the database and tuning it by making changes to its definition using the DDL and other privileged commands. DDL compiler processes schema definitions, specified in the DDL, and stores descriptions of the schemas (meta -data) in the DBMS catalog . Catalog includes information such as the names and sizes of files, names and data types of data items, storage details of each file, mapping information among schemas, and constraints, in addition to many other types of information that are needed by the DBMS modules Casual users and persons with occasional need for information from the database interact using some form of interface, interactive query interface . These queries are parsed, analyzed for correctness of the operations for the model, the name of data elements, and so on by a query compiler that compiles them into an internal form. CONTINUED.. Query optimizer is concerned with rearrangement and possible reordering of operations, elimination of redundancies, and use of correct algorithms and indexes during execution. It consults the system catalog for statistical and other physical information about the stored data and generates executable code that performs the necessary operations for the query and makes calls on the runtime processor. Precompiler extracts DML commands from an application program written in a host programming language. These commands are sent to the DML compiler for compilation into object code for database access. The rest of the programming is sent to the host language compiler. CONTINUED.. In lower half of the figure the runtime database processor is shown to execute 1. The privileged commands, 2. The executable query plans, and 3. The canned transactions with runtime parameters. It works with the system dictionary and may update it with statistics. It works with the stored data manager, for carrying out low - level input/output operations between disk and memory, management of buffers in main memory. Concurrency control and backup and recovery systems separately as module for transaction management. CONTINUED.. Common utilities have the following types of functions: 1.Loading  is used to load existing data files into the database, transferring data from one DBMS to another, loading programs are called conversion tools . 2.Backup  dumping the entire database onto tape, this backup can be used to restore the database. 3.Database storage reorganization  reorganize a set of database files into a different file organization to improve performance. 4.Performance monitoring  monitors database usage and provides information to the DBA 5.Other utilities for sorting files, handling data compression, monitoring access by users, interfacing with the network, and performing other functions DATABASE SYSTEM UTILITIES CASE tools used in design phase of database systems. Data dictionary / data repository is used to store catalog. (Stored information like schema descriptions and other information such as design decisions, application program descriptions, user information, usage standards, etc. Such system called information repository .) Active data dictionary is accessed by DBMS software and users/DBA, Passive data dictionary is accessed by users/DBA only . Application development environment systems provide an environment for developing database applications. .Ex: Jbuilder , PowerBuilder system (It used for database design, GUI development, querying and updating, and application program development) TOOLS, APPLICATION ENVIRONMENTS, AND COMMUNICATIONS FACILITIES Communications software , allow users to remote access database.  These are connected to the database site through data communications hardware such as Internet routers, phone lines, long -haul networks, local networks, or satellite communication devices  The integrated DBMS and data communications system is called a DB/DC system CONITNUED .."
      }
    },
    {
      "id": "Module_1",
      "type": "Module",
      "properties": {
        "name": ":ER Model and Relational Data Model Dr. Aruna M G Associate Professor Dept. of AI&ML, DSCE Data Modelling using the Entity-Relationship(ER) model: Using High-Level Conceptual Data Models for Database Design, A sample Database Application, Entity types, Entity Sets, Attributes, and Keys, Relationship Types, Relationship Sets, Roles and Structural Constraints, Weak Entity types, Refining the ER Design, ER Diagrams, Naming Conventions and Design Issues, Relationship Types of Degree Higher than two, Relational Database Design using ER-to-Relational Mapping. Requirements Collection & Analysis Data Requirements Functional Requirements Conceptual Design Logical Design Physical DesignUser Defined Operations Data Flow Diagrams Sequence Diagrams, ScenariosEntity Types, Constraints , Relationships No Implementation Details. Ensures Requirements Meets the Design Data Model Mapping  Type of Database is identified Internal Storage Structures / Access Path / File Organizations Conceptual Data Model Logical Data Model Physical Data Model Entity-relationship Model Typically used for conceptual database design Relational Model Typically used for logical database design Mini-World Relation A relational database is made up of a collection of tables or relation. Common terms DBMS RDBMS 1.Database Table Database 2.Table Table Relation 3.Column Field Attribute 4. Row record tuple Tuples Relation Attributes EMPLOYEE SSN Name Age Address Salary 123467 Aruna 25 #45,Bangalore 20000 123469 Thunga 26 #35,hassan 12000 123468 Nimi 27 #23,Bangalore 15000 123567 Sur 28 Null 20000 Figure2.3Employee Relation ER Model (Entity Relationship Model) The ER model describes data as entities, relationships, and attributes Regular Weak CREATE TABLE Employees (ssn CHAR (11), name CHAR (20), lot INTEGER, PRIMARY KEY (ssn))Employeessn name lotSSN NAME LOT 123- 22- 3666Attishoo 48 231- 31- 5368Smiley 22 131- 24- 3650Smethurst35 Entity SetAttributes Attribute Type: It is the property of entity type instance is called attribute type Attribute Instance: It is the property of entity instance is called attribute instance. A specific entity will have a value for each of its attributes. For example a specific employee entity may have Name='John Smith', SSN='123456789', Address ='731, Fondren, Houston, TX', Sex='M', BirthDate='09-JAN-55  customer has cust-streetcust-idcust-name cust-cityaccount balancenumberaccess-date customer cust-streetcust-idcust-name cust-cityhas account balancenumberaccess-date phone no.date-of-birthage month day year Composite Attribute customer cust-streetcust-idcust-name cust-cityhas account balancenumberaccess-date phone no.date-of-birthage Complex The composite and multi-valued attributes may be nested arbitrarily to any number of levels although this is rare. Or The combination of composite and multivalued attribute is also called complex attribute. Composite attribute between denoted by parentheses ( ) and multivalued attributes between braces { }. Example1: PreviousDegrees of a STUDENT is a composite multi- valued attribute denoted by {PreviousDegrees (College, Year, Degree, Field)}. Example2: Null Attirbute An entity may not have any applicable value for an attribute. A special value is used in such situation called NULL. Example: PhoneNo or Degree attribute of EMPLOYEE entity. The unknown category of Null is classified into two cases: 1.The first case arises when it is know that the attribute value exists but is missing. 2.The second case, when it is not known whether the attribute value exist or not. An entity type has an attribute whose values can be used to identify each entity uniquely is called a key attribute. Keys are one of the basic requirements of a relational database model. It is widely used to identify the tuples(rows) uniquely in the table. We also use keys to set up relations amongst various columns and tables of a relational database. EMPLOYEESSN Age Different Types of Database Keys Candidate Key Primary Key Super Key Alternate Key Foreign Key Composite Key Super Key The set of attributes that can uniquely identify a tuple is known as Super Key. For Example, STUD_NO, (STUD_NO, STUD_NAME), A super key is a group of single or multiple keys that identifies rows in a table. It supports NULL values. Adding zero or more attributes to the candidate key generates the super key. A candidate key is a super key but vice versa is not true. Super Key values may also be NULL. An entity type may have more than one key called candidate key. Or The minimal set of attributes that can uniquely identify a tuple is known as a candidate key. For example, the CAR entity type may have two keys: VehicleIdentificationNumber (popularly called VIN) and VehicleTagNumber (Number, State), also known as license_plate number. CARReg VIDState RegNo Make Model Year Color For Example, STUD_NO in STUDENT relation. It is a minimal super key. It is a super key with no repeated data is called a candidate key. The minimal set of attributes that can uniquely identify a record. It must contain unique values. It can contain NULL values. Every table must have at least a single candidate key. A table can have multiple candidate keys but only one primary key. The value of the Candidate Key is unique and may be null for a tuple. There can be more than one candidate key in a relationship. There can be more than one candidate key in relation out of which one can be chosen as the primary key. It is a unique key. It can identify only one tuple (a record) at a time. It has no duplicate values, it has unique values. It cannot be NULL. Primary keys are not necessarily to be a single column; more than one column can also be a primary key for a table. STUD_NO, as well as STUD_PHONE, are candidate keys for relation STUDENT but STUD_NO can be chosen as the primary key (only one out of many candidate keys). STUDENT table -> Student(STUD_NO, SNAME, ADDRESS, PHONE) , STUD_NO is a primary key. STUD_NO SNAME ADDRESS PHONE 1 Shyam Delhi 123456789 2 Rakesh Kolkata 223365796 3 Suraj Delhi 175468965Table STUDENT Composite Key (CK) A key attribute may be composite. Such attribute is composite key. Or A table might not have a single column/attribute that uniquely identifies all the records of a table. To uniquely identify rows of a table, a combination of two or more columns/attributes can be used. For example, VehicleTagNumber is a key of the CAR entity type with components (Number, State). Example2: Flight table Flight_ID is composite key It still can give duplicate values in rare cases. So, we need to find the optimal set of attributes that can uniquely identify rows in a table. It acts as a primary key if there is no primary key in a table Two or more attributes are used together to make a composite key. Different combinations of attributes may give different accuracy in terms of identifying the rows uniquely. If an attribute can only take the values which are present as values of some other attribute, it will be a foreign key to the attribute to which it refers. The relation which is being referenced is called referenced relation and the corresponding attribute is called referenced attribute the relation which refers to the referenced relation is called referencing relation and the corresponding attribute is called referencing attribute. The referenced attribute of the referenced relation should be the primary key to it. It is a key it acts as a primary key in one table and it acts as secondary key in another table. It combines two or more relations (tables) at a time. They act as a cross-reference between the tables.  customer cust-streetcust-idcust-name cust-city phone no.agedate-of-birthPossible Keys: {cust-id} {cust-name, cust-city, cust-street} {cust-id, age} cust-name ?? Probably not. Domain knowledge dependent !! customer cust-streetcust-idcust-name cust-city phone no.agedate-of-birth Value set (or Domain) of attributes The domain of an attribute is the set of all possible values from which the attributes can take its values. Value sets are not displayed in ER diagrams. It is specified during creating entity type. Example1: Season attribute have the possible values are Spring, Summer, Autumn, Winter. Example2 :Gender attribute can have Female or Male. Mathematically Definition of value sets of attribute: An attribute A of entity type E whose vale set is V can be defined as a function from E to the power set P(V) of V; A : E P(V) customer has account customer has account customer has account customer has accountExpress the number of entities to which another entity can be associated via a relationship set. Relationship Type A relationship type between two entity types defines the set of all association between these entity types. A relationship relates two or more distinct entities with a specific meaning. or A relationship type R among n entity types E1,E2, ,., En defines a set of associations. Relationship set An instance of a relationship set is a set of relationship. Relationship instance Each instance of the relationship between members of these entity types is called a relationship instance. ri = ( e1,., en ) Mathematically, the relationship set R is a set of relationship instance ri , where each ri associates n individual entities ( e1,., en ) and each entity ei in ri is a member of entity type Ej ,1<=j<=n. Where R be the relationship type. E1,E2,.En be the entity type. e1 through en, are entity set and ri is the relationship instances. Degree of a relationship types Degree Multiplicity customer has cust-streetcust-idcust-name cust-cityaccount balancenumberaccess-date ER Model: Another Example Departmentdid dnamebudget Works_in Employeessn name lot Reports_Tosupervisor Sub- ordinate Ternary Relationships Departmentdid dnamesince Works_in Employeessn name lotbudget Location capacityaddress CREATE TABLE Works_ In( ssn CHAR (11), did INTEGER, since DATE, PRIMARY KEY (ssn, did), FOREIGN KEY (ssn) REFERENCES Employees, FOREIGN KEY (did) REFERENCES Departments)SSN DIDSINCE 123-22-366651 1/1/91 123-22-366656 3/3/93 231-31-536851 2/2/92ER Model (Contd.) Works_ In Role names Each entity type that participates in a relationship type plays a particular role in the relationship. Role names may be added to make the meaning more explicit. When to use role name? The participating entity types are distinct, no need to mention role name. If the same entity type participates more than once in an r/n type in different roles.  In such cases the role name becomes essential for distinguishing the meaning of each participation. Such r/n types are called recursive relationship. Subordinate Manager EMPLOYEE Manages Attributes of relationship types Relationship types can also have attribute similar to those of entity type. customer hascust-id accountnumberaccess-date Note: Placing the attribute in relationship type i.e 1:1, 1:N and M:M . Representing this attribute in one of the entity type. customer hascust-id accountnumberaccess-date customer hascust-id accountnumberaccess-date customer hascust-id accountnumberaccess-date If one-to-one relationship, either {cust-id} or {account-number} sufficient Since a given customer can only have one account, He / She can only participate in one relationship Ditto account customer hascust-id accountnumberaccess-date If one-to-many relationship (as shown), {account-number} is a candidate key A given customer can have many accounts, but at most one account holder per account allowed Constraints on Relationships Types (constraints means restriction or limitation) Relationship types have certain constraints that limit the possible combination of entities that may participate in the corresponding relationship set. Example: a company has a rule that each employee must work for exactly one department.  There two main types of relationship constraints Cardinality ratio (Maximum Cardinality constraint ) Participation (also called Minimum Cardinality or participation constraint or existence dependency constraints) Constraints ratio for binary Relationship Types (Also known as ratio constraints)  Cardinality ratio (Maximum Cardinality) for a binary relationship specifies the maximum number of relationship instances that an entity can participate in.  One-to-one (1:1)  One-to-many (1:N)  Many-to-one (N:1)  Many-to-many (M:N) It specifies whether the existence of an entity depends on its being related to another entity the relationship types. This constraint specifies the minimum number of relationship instances that each entity can participate in. This type is called Minimum Cardinality constraint. There are two types of Participation constraint 1.Total Participation constraint (or existence dependency): 2.Partial Participation constraint customer has cust-streetcust-idcust-name cust-cityaccount balancenumberaccess-date Total participation lotname dname budget didsince name dname budget didsince Manages sinceDepartments Employeesssn Works_In0,M 1,M 1,1 1,M customer hascust-id accountnumberaccess-date 0..* 1..1How many relationships can an entity participate in ? Minimum - 0 Maximum  no limitMinimum - 1 Maximum - 1 employee works-for emp-streetemp-idemp-name emp-citymanager worker Student ModuleRegisterSID NameAddr MID Title Grade(0,8) (1,n) lotname age pname Dependents Employeesssn Policycost Partial Key account balancenumber Transaction has trans-typetrans-numbertrans-date trans-amt Partial Key Summary of Notations in ER Model Works_In does not allow an employee to work in a department for two or more periods (why?)Entity vs. Attribute Works_inDepartmentdid dnamebudgetfrom Employeessn name lot to Entity vs. Attribute (Contd.) Works_inDepartmentdid dnamebudget fromEmployeessn name lot to Duration pnameBinary vs. Ternary Relationships Dependentage costEmployeessn name lot covers Policy policyid Dependentpnameage costEmployeessn name lot Beneficiary PolicypolicyidBetter Design purchaserBinary vs. Ternary Relationships  Some constraints cannot be captured in ER diagrams: Functional dependencies Inclusion dependencies General constraintsConstraints Beyond the ER Model DEPARTMENT DEPT_ EMP EMPLOYEE EMP_ DEP DEPENDENTPROJ_ WORK PROJ_ MGRPROJECTSUPPLIER SUPP_ PART_ PROJ PART PART_ STRUC TURESUPP_ PARTMM MM MMM M M MMM1 1 1 DEPARTMENT ( Name, Number, { Locations }, Manager, Start Date ) PROJECT ( Name, Number, Location, Controlling Department ) EMPLOYEE (Name (Fname, Lname), SSN, Gender, Address, Salary Birthdate, Department, Supervisor, (Workson ( Project , Hrs)) DEPENDENT ( Employee, Name, Gender, Birthdate, Relationship ) Department EmployeeWork s ForName NoLoc Controls Project NameNoLocWork s OnmanagesSdate Hours Depend On Name SexBdateRelationshipSupe rvise sAddressFname SexSSN Name BdateSalLname Dependent Student Course EnrollID Name DOB CID Cname Date Status Student IDNameDOBCourse CIDCname Enroll IDCIDDateStatusPKPK FK FKER to Relational mappingM N Foreign Keys CREATE TABLE Employees (ssn CHAR(11), name CHAR(20), lot INTEGER, PRIMARY KEY (ssn))Employeesssnname lotssn name lot 123-22-3666Attishoo 48 231-31-5368Smiley 22 131-24-3650Smethurst35 CREATE TABLE Works_In( ssn CHAR(1), did INTEGER, since DATE, PRIMARY KEY (ssn, did), FOREIGN KEY (ssn) REFERENCES Employees, FOREIGN KEY (did) REFERENCES Departments) ssn didsince 123-22-3666511/1/91 123-22-3666563/3/93 231-31-5368512/2/92 CREATE TABLE Manages( ssn CHAR(11), did INTEGER, since DATE, PRIMARY KEY (did), FOREIGN KEY (ssn) REFERENCES Employees, FOREIGN KEY (did) REFERENCES Departments)CREATE TABLE Dept_Mgr( did INTEGER, dname CHAR(20), budget REAL, ssn CHAR(11), since DATE, PRIMARY KEY (did), FOREIGN KEY (ssn) REFERENCES Employees)Vs.dname budget didsince lotname ssn Manages Employees Departments CREATE TABLE Dep_Policy ( pname CHAR(20), age INTEGER, cost REAL, ssn CHAR(11) NOT NULL, PRIMARY KEY (pname, ssn), FOREIGN KEY (ssn) REFERENCES Employees, ON DELETE CASCADE) Introduction The Relational Model is based on the concept of a Relation. Represents Database as a collection of Relations A Relation is a mathematical concept based on the ideas of sets. The strength of the relational approach to data management comes from the formal foundation provided by the theory of relations. The model was first proposed by Dr. E F Codd of IBM in 1970 in the following paper: \"A Relational Model for Large Shared Data Banks,\" Communications of the ACM, June 1970. The above paper caused a major revolution in the field of Database management and earned Ted Codd the coveted ACM Turing Award. RELATION: A table of values A relation may be thought of as a set of rows OR set of columns. Each row represents a fact that corresponds to a real-world entity or relationship. Also called as Tuple Each row has a value of an item or set of items that uniquely identifies that row in the table Each column typically is called by its column name represents attribute Relation schema R is defined over attributes R(A1, A2, ...,An) Relational Database Schema: A set S of relation schemas that belong to the same database. S = {R1, R2, ..., Rn} The degree of a relation is the number of attributes n Composite and multi-valued attributes are not allowed. Constraints are conditions that must hold on all valid relation instances. There are three main types of constraints: Key constraints Entity integrity constraints Referential integrity constraints Key Constraints Super key of R: A set of attributes SK of R such that no two tuples in any valid relation instance r(R) will have the same value for SK. That is, for any distinct tuples t1 and t2 in r(R), t1[SK]  t2[SK]. Key of R: A \"minimal\" super key; that is, a super key K such that removal of any attribute from K results in a set of attributes that is not a super key. Example: The CAR relation schema: CAR(State, Reg#, SerialNo, Make, Model, Year) has two keys Key1 = {State, Reg#}, Key2 = {SerialNo}, which are also super keys. {SerialNo, Make} is a super key but not a key. Note: If a relation has several candidate keys (a relation schema may have more than one key) , one is chosen arbitrarily to be the primary key. The primary key attributes are underlined. Entity Integrity The primary key attributes PK of each relation schema R cannot have null values in any tuple of r(R). No primary key value can be NULL. t[PK]  null for any tuple t in r(R) This is because primary key values are used to identify the individual tuples Referential Integrity ( Used to specify a relationship among tuples in two relations: The referencing relation and the referenced relation. Tuples in the referencing relation R1 have attributes FK (called foreign key attributes) that reference the primary key attributes PK of the referenced relation R2. i.e., A tuple t1 in R1 is said to reference a tuple t2 in R2 if t1[FK] = t2[PK]. A referential integrity constraint is displayed in a relational database schema as a directed arc from R1.FK to R2.PK Referential Integrity Constraints on COMPANY Schema sid cid grade 53666carnatic101 C 53688reggae203 B 53650topology112 A 53666history105 Bsid name age 53666Jones 18 53688Smith 18 53650Smith 19gpa 3.4 3.2 3.8login Jones@cs Smith@eecs Smith@mathEnrolled Student Primary keyForeign key referring to sid of STUDENT relation Update Operations on Relations INSERT a tuple. Ex: Insert < Ceilia, F, Kolonsky,677678984,. > into EMPLOYEE DELETE a tuple. Ex : Delete the EMPLOYEE tuple with SSN=9987. MODIFY a tuple. Ex : modify SALARY of the EMPLOYEE tuple SSN=998877 to 28000. Integrity constraints should not be violated by the update operations. Several update operations may have to be grouped together. Updates may propagate to cause other updates automatically. This may be necessary to maintain integrity constraints. Consider the following relations for a database that keeps track of student enrollment in courses and the books adopted for each course: STUDENT(SSN, Name, Major, Bdate) COURSE(Course#, Cname, Dept) ENROLL(SSN, Course#, Quarter, Grade) BOOK_ADOPTION(Course#, Quarter, Book_ISBN) TEXT(Book_ISBN, Book_Title, Publisher, Author) Draw a relational schema diagram specifying the foreign keys for this schema. The Attribute SSN of relation ENROLL that references relation STUDENT The Attribute Course# of relation ENROLL that references relation COURSE The Attribute Course# of relation BOOK_ADOPTION that references relation COURSE The Attribute Book_ISBN of relation BOOK_ADOPTION that references relation TEXT Relational Algebra is the query language for Relational Data Model enable the user to specify basic retrieval requests (queries). Set theory operations (Mathematical) { Union, Intersection, Difference, Relational Algebra operations: Cartesian product } Relational database operations. {Select, project, Join} All operations may operate on one or more relations and the result is in the form of a relation. SELECT Operation () Used to select a subset of the tuples from a relation that satisfy a selection condition Gives the horizontal subset ( selected tuples) of a Relation Syntax: <selection condition> (R) where  (sigma) is used to denote the select operator, and the selection condition is a Boolean expression specified on the attributes of relation R Example1: To select the EMPLOYEE tuples whose department number is four DNO = 4 (EMPLOYEE) Example 2: To select the EMPLOYEE tuples whose salary is greater than $30,000  SALARY > 30,000 (EMPLOYEE) SELECT Operation Properties The SELECT operation  <selection condition>(R) produces a relation S that has the same schema as R The SELECT operation s is commutative  <condition1>( < condition2> (R)) =  <condition2> ( < condition1> (R)) A cascaded SELECT operation may be applied in any order; <cond1>(<cond2> (<cond3> (R)) = <cond2> (<cond3> (<cond1> ( R))) A cascaded SELECT operation may be replaced by a single selection with a conjunction of all the conditions; i.e., <cond1>(< cond2> (<cond3>(R)) =<cond1> AND < cond2> AND < cond3>(R))) PROJECT Operation () Projects certain columns from the relation/table and discards the other columns. Gives the vertical subset (selected columns) of a relation Creates a vertical partitioning  one with the needed columns (attributes) containing results of the operation and other containing the discarded Columns. Syntax: <attribute list>(R) , where  (pi) is the symbol used to represent the project operation and <attribute list> is the desired list of attributes from the attributes of relation R. removes any duplicate tuples, so the result of the project operation is a set of tuples and hence a valid relation. Example: To list each employees first and last name and salary, the following is used: LNAME, FNAME, SALARY (EMPLOYEE) PROJECT Operation Properties If the list of attributes includes a key of R, then the number of tuples in the result of projection <list>(R) is always less or equal to the number of tuples in R.  <list1> ( <list2> (R) ) = <list1> (R) as long as <list2> contains the attributes in <list1> Sequence of SELECT and PROJECT operations Several operations can be combined to form a relational algebra expression (query) Example: Retrieve the names and salaries of employees who work in department 4:  FNAME, LNAME, SALARY ( DNO=4 (EMPLOYEE) ) Alternatively, we specify explicit intermediate relations for each step: DEPT4_EMPS   DNO=4 (EMPLOYEE) R  FNAME, LNAME, SALARY (DEPT4_EMPS ) Set theory Operations Binary operations from mathematical set theory: UNION: R1R2, INTERSECTION: R1  R2, SET DIFFERENCE: R1  R2, CARTESIAN PRODUCT: R1  R2. For , , , the operand relations R1(A1,A2,,An) and R2(B1,B2,,Bn) must have the same number of attributes, and the domains of corresponding attributes must be compatible; that is, dom(Ai)=dom(Bi) for i=1,2,, n. This condition is called union compatibility. The resulting relation for , , or  has the same attribute names as the first operand R1 (by convention). JOIN Operation The sequence of Cartesian product followed by select is used quite commonly to identify and select related tuples from two relations, a special operation, called JOIN. It is denoted by This operation is very important for any relational database with more than a single relation, because it allows us to process relationships among relations. The general form of a join operation on two relations R(A1, A2, . . ., An) and S(B1, B2, . . ., Bm) is: R <join condition> S where R and S can be any relations that result from general relational algebra expressions. Types Equijoin Natural Join Theta Join sid bid 22 101 58 103day 10/10/99 11/12/99 sid sname age 22 Deepa 45.0 31 Laxmi 55.5 58 Roopa 35.0rating 7 8 10 sid sname age 28 Yamuna 35.0 31 Laxmi 55.5 44 Geeta 35.0rating 9 8 5 58 Roopa 35.0 10R1 S1 S2 sname Yamuna Laxmi Geetarating 9 8 5 Roopa 10 age 35.0sname, rating(S2) age(S2) 55.5 sid sname age 28 Yamuna 35.0rating 9 58 Roopa 35.0 10rating > 8(S2) sname Yamunarating 9 Roopa 10 sname, rating(S2) (rating > 8(S2)) sid sname age 22 Deepa 45.0 31 Laxmi 55.5 58 Roopa 35.0rating 7 8 10 44 Geeta 35.0 28 Yamuna 35.05 9 sid sname age 22 Deepa 45.0rating 7sid sname age 31 Laxmi 55.5 58 Roopa 35.0rating 8 10S1  S2 S1  S2S1  S2 (sid)bid 22 101 58 103day 10/10/99 11/12/99(sid)sname age 22 Deepa 45.0 22 Deepa 45.0 31 Laxmi 55.5rating 7 7 8 31 Laxmi 55.5 58 Roopa 35.0 58 Roopa 35.08 10 1022 101 10/10/99 58 103 11/12/99 22 101 10/10/99 58 103 11/12/99 Condition Join : (sid)bid 58 103 58 103day 11/12/99 11/12/99(sid)sname age 22 Deepa 45.0 31 Laxmi 55.5rating 7 8 bid 101 103day 10/10/99 11/12/99(sid)sname age 22 Deepa 45.0 58 Roopa 35.0rating 7 10 snopno s1 p1 s1 p2 s1 p3 s1 p4 s2 p1 s2 p2 s3 p2 s4 p2 s4 p4Apno p2pno p1 p2 p4pno p2 p4B1 B2 B3sno s1 s2 s3 s4sno s1 s4sno s1 A/B1 A/B2 A/B3Not supported as a primitive operator, but useful for expressing queries like: Find sailors who have reserved all boats . A B   1 2 1A B  2 3 r s A B  2 A B     1 2 4 1 2C D     a a b a bB 1 3 1 2 3D a a a b bE      r A B     1 1 1 1 2C D     a a a a bE     s nr s n Notation: r s r.A, r.B, r.C, r.D, s.E (r.B = s.Br.D = s.D (r x s)) )()(,,(),( ,,,2 2 11 21E n n n AF AFAF G GG   A B       C 7 7 3 10 g sum(c) (r) sum(c ) 27 Question: Which aggregate operations cannot be expressed using basic relational operations? branch_name g sum(balance) (account)branch_nameaccount_number balance Perryridge Perryridge Brighton Brighton RedwoodA-102 A-201 A-217 A-215 A-222400 900 750 750 700 branch_name sum(balance) Perryridge Brighton Redwood1300 1500 700 nRelation borrower customer_nameloan_number Jones Smith HayesL-170 L-230 L-1553000 4000 1700loan_number amount L-170 L-230 L-260branch_name Downtown Redwood Perryridge loan_number amount L-170 L-2303000 4000customer_name Jones Smithbranch_name Downtown Redwood Jones Smith nullloan_number amount L-170 L-230 L-2603000 4000 1700customer_name branch_name Downtown Redwood PerryridgeLeft Outer Join borrower loan loan_number amount L-170 L-230 L-1553000 4000 nullcustomer_name Jones Smith Hayesbranch_name Downtown Redwood null loan_number amount L-170 L-230 L-260 L-1553000 4000 1700 nullcustomer_name Jones Smith null Hayesbranch_name Downtown Redwood Perryridge nullFull Outer Join loan borrowerRight Outer Join loan borrower Question: can outerjoins be expressed using basic relational algebra operations Find the loan number for each loan of an amount greater than $1200 amount > 1200 (loan) loan_number (amount > 1200 (loan)) Find the names of all customers who have a loan, an account, or both, from the bank customer_name (borrower)  customer_name (depositor) n Find the names of all customers who have a loan at the Perryridge branch but do not have an account at any branch of the bank. customer_name (branch_name = Perryridge (borrower.loan_number = loan.loan_number(borrower x loan)))  customer_name(depositor)customer_name (branch_name=Perryridge (borrower.loan_number = loan.loan_number(borrower x loan))) l customer_name(loan.loan_number = borrower.loan_number ( (branch_name = Perryridge (loan)) x borrower))l customer_name (branch_name = Perryridge ( borrower.loan_number = loan.loan_number (borrower x loan))) 1.Database systems Models, Languages, Design and Application Programming, RamezElmasri and Shamkant B. Navathe, 7th Edition, 2017, Pearson. 2.Database Management Systems, Ramakrishnan, and Gehrke, 3rd Edition, 2014, McGraw Hill 3.Database System Concepts, Silberschatz Korth and Sudharshan,, 6th Edition, McGrawHill, 2013. 4.Database Principles Fundamentals of Design, Implementation and Management, Coronel, Morris, and Rob, Cengage Learning, 2012.",
        "module_number": 2,
        "description": "Module covering :ER Model and Relational Data Model Dr. Aruna M G Associate Professor Dept. of AI&ML, DSCE Data Modelling using the Entity-Relationship(ER) model: Using High-Level Conceptual Data Models for Database Design, A sample Database Application, Entity types, Entity Sets, Attributes, and Keys, Relationship Types, Relationship Sets, Roles and Structural Constraints, Weak Entity types, Refining the ER Design, ER Diagrams, Naming Conventions and Design Issues, Relationship Types of Degree Higher than two, Relational Database Design using ER-to-Relational Mapping. Requirements Collection & Analysis Data Requirements Functional Requirements Conceptual Design Logical Design Physical DesignUser Defined Operations Data Flow Diagrams Sequence Diagrams, ScenariosEntity Types, Constraints , Relationships No Implementation Details. Ensures Requirements Meets the Design Data Model Mapping  Type of Database is identified Internal Storage Structures / Access Path / File Organizations Conceptual Data Model Logical Data Model Physical Data Model Entity-relationship Model Typically used for conceptual database design Relational Model Typically used for logical database design Mini-World Relation A relational database is made up of a collection of tables or relation. Common terms DBMS RDBMS 1.Database Table Database 2.Table Table Relation 3.Column Field Attribute 4. Row record tuple Tuples Relation Attributes EMPLOYEE SSN Name Age Address Salary 123467 Aruna 25 #45,Bangalore 20000 123469 Thunga 26 #35,hassan 12000 123468 Nimi 27 #23,Bangalore 15000 123567 Sur 28 Null 20000 Figure2.3Employee Relation ER Model (Entity Relationship Model) The ER model describes data as entities, relationships, and attributes Regular Weak CREATE TABLE Employees (ssn CHAR (11), name CHAR (20), lot INTEGER, PRIMARY KEY (ssn))Employeessn name lotSSN NAME LOT 123- 22- 3666Attishoo 48 231- 31- 5368Smiley 22 131- 24- 3650Smethurst35 Entity SetAttributes Attribute Type: It is the property of entity type instance is called attribute type Attribute Instance: It is the property of entity instance is called attribute instance. A specific entity will have a value for each of its attributes. For example a specific employee entity may have Name='John Smith', SSN='123456789', Address ='731, Fondren, Houston, TX', Sex='M', BirthDate='09-JAN-55  customer has cust-streetcust-idcust-name cust-cityaccount balancenumberaccess-date customer cust-streetcust-idcust-name cust-cityhas account balancenumberaccess-date phone no.date-of-birthage month day year Composite Attribute customer cust-streetcust-idcust-name cust-cityhas account balancenumberaccess-date phone no.date-of-birthage Complex The composite and multi-valued attributes may be nested arbitrarily to any number of levels although this is rare. Or The combination of composite and multivalued attribute is also called complex attribute. Composite attribute between denoted by parentheses ( ) and multivalued attributes between braces { }. Example1: PreviousDegrees of a STUDENT is a composite multi- valued attribute denoted by {PreviousDegrees (College, Year, Degree, Field)}. Example2: Null Attirbute An entity may not have any applicable value for an attribute. A special value is used in such situation called NULL. Example: PhoneNo or Degree attribute of EMPLOYEE entity. The unknown category of Null is classified into two cases: 1.The first case arises when it is know that the attribute value exists but is missing. 2.The second case, when it is not known whether the attribute value exist or not. An entity type has an attribute whose values can be used to identify each entity uniquely is called a key attribute. Keys are one of the basic requirements of a relational database model. It is widely used to identify the tuples(rows) uniquely in the table. We also use keys to set up relations amongst various columns and tables of a relational database. EMPLOYEESSN Age Different Types of Database Keys Candidate Key Primary Key Super Key Alternate Key Foreign Key Composite Key Super Key The set of attributes that can uniquely identify a tuple is known as Super Key. For Example, STUD_NO, (STUD_NO, STUD_NAME), A super key is a group of single or multiple keys that identifies rows in a table. It supports NULL values. Adding zero or more attributes to the candidate key generates the super key. A candidate key is a super key but vice versa is not true. Super Key values may also be NULL. An entity type may have more than one key called candidate key. Or The minimal set of attributes that can uniquely identify a tuple is known as a candidate key. For example, the CAR entity type may have two keys: VehicleIdentificationNumber (popularly called VIN) and VehicleTagNumber (Number, State), also known as license_plate number. CARReg VIDState RegNo Make Model Year Color For Example, STUD_NO in STUDENT relation. It is a minimal super key. It is a super key with no repeated data is called a candidate key. The minimal set of attributes that can uniquely identify a record. It must contain unique values. It can contain NULL values. Every table must have at least a single candidate key. A table can have multiple candidate keys but only one primary key. The value of the Candidate Key is unique and may be null for a tuple. There can be more than one candidate key in a relationship. There can be more than one candidate key in relation out of which one can be chosen as the primary key. It is a unique key. It can identify only one tuple (a record) at a time. It has no duplicate values, it has unique values. It cannot be NULL. Primary keys are not necessarily to be a single column; more than one column can also be a primary key for a table. STUD_NO, as well as STUD_PHONE, are candidate keys for relation STUDENT but STUD_NO can be chosen as the primary key (only one out of many candidate keys). STUDENT table -> Student(STUD_NO, SNAME, ADDRESS, PHONE) , STUD_NO is a primary key. STUD_NO SNAME ADDRESS PHONE 1 Shyam Delhi 123456789 2 Rakesh Kolkata 223365796 3 Suraj Delhi 175468965Table STUDENT Composite Key (CK) A key attribute may be composite. Such attribute is composite key. Or A table might not have a single column/attribute that uniquely identifies all the records of a table. To uniquely identify rows of a table, a combination of two or more columns/attributes can be used. For example, VehicleTagNumber is a key of the CAR entity type with components (Number, State). Example2: Flight table Flight_ID is composite key It still can give duplicate values in rare cases. So, we need to find the optimal set of attributes that can uniquely identify rows in a table. It acts as a primary key if there is no primary key in a table Two or more attributes are used together to make a composite key. Different combinations of attributes may give different accuracy in terms of identifying the rows uniquely. If an attribute can only take the values which are present as values of some other attribute, it will be a foreign key to the attribute to which it refers. The relation which is being referenced is called referenced relation and the corresponding attribute is called referenced attribute the relation which refers to the referenced relation is called referencing relation and the corresponding attribute is called referencing attribute. The referenced attribute of the referenced relation should be the primary key to it. It is a key it acts as a primary key in one table and it acts as secondary key in another table. It combines two or more relations (tables) at a time. They act as a cross-reference between the tables.  customer cust-streetcust-idcust-name cust-city phone no.agedate-of-birthPossible Keys: {cust-id} {cust-name, cust-city, cust-street} {cust-id, age} cust-name ?? Probably not. Domain knowledge dependent !! customer cust-streetcust-idcust-name cust-city phone no.agedate-of-birth Value set (or Domain) of attributes The domain of an attribute is the set of all possible values from which the attributes can take its values. Value sets are not displayed in ER diagrams. It is specified during creating entity type. Example1: Season attribute have the possible values are Spring, Summer, Autumn, Winter. Example2 :Gender attribute can have Female or Male. Mathematically Definition of value sets of attribute: An attribute A of entity type E whose vale set is V can be defined as a function from E to the power set P(V) of V; A : E P(V) customer has account customer has account customer has account customer has accountExpress the number of entities to which another entity can be associated via a relationship set. Relationship Type A relationship type between two entity types defines the set of all association between these entity types. A relationship relates two or more distinct entities with a specific meaning. or A relationship type R among n entity types E1,E2, ,., En defines a set of associations. Relationship set An instance of a relationship set is a set of relationship. Relationship instance Each instance of the relationship between members of these entity types is called a relationship instance. ri = ( e1,., en ) Mathematically, the relationship set R is a set of relationship instance ri , where each ri associates n individual entities ( e1,., en ) and each entity ei in ri is a member of entity type Ej ,1<=j<=n. Where R be the relationship type. E1,E2,.En be the entity type. e1 through en, are entity set and ri is the relationship instances. Degree of a relationship types Degree Multiplicity customer has cust-streetcust-idcust-name cust-cityaccount balancenumberaccess-date ER Model: Another Example Departmentdid dnamebudget Works_in Employeessn name lot Reports_Tosupervisor Sub- ordinate Ternary Relationships Departmentdid dnamesince Works_in Employeessn name lotbudget Location capacityaddress CREATE TABLE Works_ In( ssn CHAR (11), did INTEGER, since DATE, PRIMARY KEY (ssn, did), FOREIGN KEY (ssn) REFERENCES Employees, FOREIGN KEY (did) REFERENCES Departments)SSN DIDSINCE 123-22-366651 1/1/91 123-22-366656 3/3/93 231-31-536851 2/2/92ER Model (Contd.) Works_ In Role names Each entity type that participates in a relationship type plays a particular role in the relationship. Role names may be added to make the meaning more explicit. When to use role name? The participating entity types are distinct, no need to mention role name. If the same entity type participates more than once in an r/n type in different roles.  In such cases the role name becomes essential for distinguishing the meaning of each participation. Such r/n types are called recursive relationship. Subordinate Manager EMPLOYEE Manages Attributes of relationship types Relationship types can also have attribute similar to those of entity type. customer hascust-id accountnumberaccess-date Note: Placing the attribute in relationship type i.e 1:1, 1:N and M:M . Representing this attribute in one of the entity type. customer hascust-id accountnumberaccess-date customer hascust-id accountnumberaccess-date customer hascust-id accountnumberaccess-date If one-to-one relationship, either {cust-id} or {account-number} sufficient Since a given customer can only have one account, He / She can only participate in one relationship Ditto account customer hascust-id accountnumberaccess-date If one-to-many relationship (as shown), {account-number} is a candidate key A given customer can have many accounts, but at most one account holder per account allowed Constraints on Relationships Types (constraints means restriction or limitation) Relationship types have certain constraints that limit the possible combination of entities that may participate in the corresponding relationship set. Example: a company has a rule that each employee must work for exactly one department.  There two main types of relationship constraints Cardinality ratio (Maximum Cardinality constraint ) Participation (also called Minimum Cardinality or participation constraint or existence dependency constraints) Constraints ratio for binary Relationship Types (Also known as ratio constraints)  Cardinality ratio (Maximum Cardinality) for a binary relationship specifies the maximum number of relationship instances that an entity can participate in.  One-to-one (1:1)  One-to-many (1:N)  Many-to-one (N:1)  Many-to-many (M:N) It specifies whether the existence of an entity depends on its being related to another entity the relationship types. This constraint specifies the minimum number of relationship instances that each entity can participate in. This type is called Minimum Cardinality constraint. There are two types of Participation constraint 1.Total Participation constraint (or existence dependency): 2.Partial Participation constraint customer has cust-streetcust-idcust-name cust-cityaccount balancenumberaccess-date Total participation lotname dname budget didsince name dname budget didsince Manages sinceDepartments Employeesssn Works_In0,M 1,M 1,1 1,M customer hascust-id accountnumberaccess-date 0..* 1..1How many relationships can an entity participate in ? Minimum - 0 Maximum  no limitMinimum - 1 Maximum - 1 employee works-for emp-streetemp-idemp-name emp-citymanager worker Student ModuleRegisterSID NameAddr MID Title Grade(0,8) (1,n) lotname age pname Dependents Employeesssn Policycost Partial Key account balancenumber Transaction has trans-typetrans-numbertrans-date trans-amt Partial Key Summary of Notations in ER Model Works_In does not allow an employee to work in a department for two or more periods (why?)Entity vs. Attribute Works_inDepartmentdid dnamebudgetfrom Employeessn name lot to Entity vs. Attribute (Contd.) Works_inDepartmentdid dnamebudget fromEmployeessn name lot to Duration pnameBinary vs. Ternary Relationships Dependentage costEmployeessn name lot covers Policy policyid Dependentpnameage costEmployeessn name lot Beneficiary PolicypolicyidBetter Design purchaserBinary vs. Ternary Relationships  Some constraints cannot be captured in ER diagrams: Functional dependencies Inclusion dependencies General constraintsConstraints Beyond the ER Model DEPARTMENT DEPT_ EMP EMPLOYEE EMP_ DEP DEPENDENTPROJ_ WORK PROJ_ MGRPROJECTSUPPLIER SUPP_ PART_ PROJ PART PART_ STRUC TURESUPP_ PARTMM MM MMM M M MMM1 1 1 DEPARTMENT ( Name, Number, { Locations }, Manager, Start Date ) PROJECT ( Name, Number, Location, Controlling Department ) EMPLOYEE (Name (Fname, Lname), SSN, Gender, Address, Salary Birthdate, Department, Supervisor, (Workson ( Project , Hrs)) DEPENDENT ( Employee, Name, Gender, Birthdate, Relationship ) Department EmployeeWork s ForName NoLoc Controls Project NameNoLocWork s OnmanagesSdate Hours Depend On Name SexBdateRelationshipSupe rvise sAddressFname SexSSN Name BdateSalLname Dependent Student Course EnrollID Name DOB CID Cname Date Status Student IDNameDOBCourse CIDCname Enroll IDCIDDateStatusPKPK FK FKER to Relational mappingM N Foreign Keys CREATE TABLE Employees (ssn CHAR(11), name CHAR(20), lot INTEGER, PRIMARY KEY (ssn))Employeesssnname lotssn name lot 123-22-3666Attishoo 48 231-31-5368Smiley 22 131-24-3650Smethurst35 CREATE TABLE Works_In( ssn CHAR(1), did INTEGER, since DATE, PRIMARY KEY (ssn, did), FOREIGN KEY (ssn) REFERENCES Employees, FOREIGN KEY (did) REFERENCES Departments) ssn didsince 123-22-3666511/1/91 123-22-3666563/3/93 231-31-5368512/2/92 CREATE TABLE Manages( ssn CHAR(11), did INTEGER, since DATE, PRIMARY KEY (did), FOREIGN KEY (ssn) REFERENCES Employees, FOREIGN KEY (did) REFERENCES Departments)CREATE TABLE Dept_Mgr( did INTEGER, dname CHAR(20), budget REAL, ssn CHAR(11), since DATE, PRIMARY KEY (did), FOREIGN KEY (ssn) REFERENCES Employees)Vs.dname budget didsince lotname ssn Manages Employees Departments CREATE TABLE Dep_Policy ( pname CHAR(20), age INTEGER, cost REAL, ssn CHAR(11) NOT NULL, PRIMARY KEY (pname, ssn), FOREIGN KEY (ssn) REFERENCES Employees, ON DELETE CASCADE) Introduction The Relational Model is based on the concept of a Relation. Represents Database as a collection of Relations A Relation is a mathematical concept based on the ideas of sets. The strength of the relational approach to data management comes from the formal foundation provided by the theory of relations. The model was first proposed by Dr. E F Codd of IBM in 1970 in the following paper: \"A Relational Model for Large Shared Data Banks,\" Communications of the ACM, June 1970. The above paper caused a major revolution in the field of Database management and earned Ted Codd the coveted ACM Turing Award. RELATION: A table of values A relation may be thought of as a set of rows OR set of columns. Each row represents a fact that corresponds to a real-world entity or relationship. Also called as Tuple Each row has a value of an item or set of items that uniquely identifies that row in the table Each column typically is called by its column name represents attribute Relation schema R is defined over attributes R(A1, A2, ...,An) Relational Database Schema: A set S of relation schemas that belong to the same database. S = {R1, R2, ..., Rn} The degree of a relation is the number of attributes n Composite and multi-valued attributes are not allowed. Constraints are conditions that must hold on all valid relation instances. There are three main types of constraints: Key constraints Entity integrity constraints Referential integrity constraints Key Constraints Super key of R: A set of attributes SK of R such that no two tuples in any valid relation instance r(R) will have the same value for SK. That is, for any distinct tuples t1 and t2 in r(R), t1[SK]  t2[SK]. Key of R: A \"minimal\" super key; that is, a super key K such that removal of any attribute from K results in a set of attributes that is not a super key. Example: The CAR relation schema: CAR(State, Reg#, SerialNo, Make, Model, Year) has two keys Key1 = {State, Reg#}, Key2 = {SerialNo}, which are also super keys. {SerialNo, Make} is a super key but not a key. Note: If a relation has several candidate keys (a relation schema may have more than one key) , one is chosen arbitrarily to be the primary key. The primary key attributes are underlined. Entity Integrity The primary key attributes PK of each relation schema R cannot have null values in any tuple of r(R). No primary key value can be NULL. t[PK]  null for any tuple t in r(R) This is because primary key values are used to identify the individual tuples Referential Integrity ( Used to specify a relationship among tuples in two relations: The referencing relation and the referenced relation. Tuples in the referencing relation R1 have attributes FK (called foreign key attributes) that reference the primary key attributes PK of the referenced relation R2. i.e., A tuple t1 in R1 is said to reference a tuple t2 in R2 if t1[FK] = t2[PK]. A referential integrity constraint is displayed in a relational database schema as a directed arc from R1.FK to R2.PK Referential Integrity Constraints on COMPANY Schema sid cid grade 53666carnatic101 C 53688reggae203 B 53650topology112 A 53666history105 Bsid name age 53666Jones 18 53688Smith 18 53650Smith 19gpa 3.4 3.2 3.8login Jones@cs Smith@eecs Smith@mathEnrolled Student Primary keyForeign key referring to sid of STUDENT relation Update Operations on Relations INSERT a tuple. Ex: Insert < Ceilia, F, Kolonsky,677678984,. > into EMPLOYEE DELETE a tuple. Ex : Delete the EMPLOYEE tuple with SSN=9987. MODIFY a tuple. Ex : modify SALARY of the EMPLOYEE tuple SSN=998877 to 28000. Integrity constraints should not be violated by the update operations. Several update operations may have to be grouped together. Updates may propagate to cause other updates automatically. This may be necessary to maintain integrity constraints. Consider the following relations for a database that keeps track of student enrollment in courses and the books adopted for each course: STUDENT(SSN, Name, Major, Bdate) COURSE(Course#, Cname, Dept) ENROLL(SSN, Course#, Quarter, Grade) BOOK_ADOPTION(Course#, Quarter, Book_ISBN) TEXT(Book_ISBN, Book_Title, Publisher, Author) Draw a relational schema diagram specifying the foreign keys for this schema. The Attribute SSN of relation ENROLL that references relation STUDENT The Attribute Course# of relation ENROLL that references relation COURSE The Attribute Course# of relation BOOK_ADOPTION that references relation COURSE The Attribute Book_ISBN of relation BOOK_ADOPTION that references relation TEXT Relational Algebra is the query language for Relational Data Model enable the user to specify basic retrieval requests (queries). Set theory operations (Mathematical) { Union, Intersection, Difference, Relational Algebra operations: Cartesian product } Relational database operations. {Select, project, Join} All operations may operate on one or more relations and the result is in the form of a relation. SELECT Operation () Used to select a subset of the tuples from a relation that satisfy a selection condition Gives the horizontal subset ( selected tuples) of a Relation Syntax: <selection condition> (R) where  (sigma) is used to denote the select operator, and the selection condition is a Boolean expression specified on the attributes of relation R Example1: To select the EMPLOYEE tuples whose department number is four DNO = 4 (EMPLOYEE) Example 2: To select the EMPLOYEE tuples whose salary is greater than $30,000  SALARY > 30,000 (EMPLOYEE) SELECT Operation Properties The SELECT operation  <selection condition>(R) produces a relation S that has the same schema as R The SELECT operation s is commutative  <condition1>( < condition2> (R)) =  <condition2> ( < condition1> (R)) A cascaded SELECT operation may be applied in any order; <cond1>(<cond2> (<cond3> (R)) = <cond2> (<cond3> (<cond1> ( R))) A cascaded SELECT operation may be replaced by a single selection with a conjunction of all the conditions; i.e., <cond1>(< cond2> (<cond3>(R)) =<cond1> AND < cond2> AND < cond3>(R))) PROJECT Operation () Projects certain columns from the relation/table and discards the other columns. Gives the vertical subset (selected columns) of a relation Creates a vertical partitioning  one with the needed columns (attributes) containing results of the operation and other containing the discarded Columns. Syntax: <attribute list>(R) , where  (pi) is the symbol used to represent the project operation and <attribute list> is the desired list of attributes from the attributes of relation R. removes any duplicate tuples, so the result of the project operation is a set of tuples and hence a valid relation. Example: To list each employees first and last name and salary, the following is used: LNAME, FNAME, SALARY (EMPLOYEE) PROJECT Operation Properties If the list of attributes includes a key of R, then the number of tuples in the result of projection <list>(R) is always less or equal to the number of tuples in R.  <list1> ( <list2> (R) ) = <list1> (R) as long as <list2> contains the attributes in <list1> Sequence of SELECT and PROJECT operations Several operations can be combined to form a relational algebra expression (query) Example: Retrieve the names and salaries of employees who work in department 4:  FNAME, LNAME, SALARY ( DNO=4 (EMPLOYEE) ) Alternatively, we specify explicit intermediate relations for each step: DEPT4_EMPS   DNO=4 (EMPLOYEE) R  FNAME, LNAME, SALARY (DEPT4_EMPS ) Set theory Operations Binary operations from mathematical set theory: UNION: R1R2, INTERSECTION: R1  R2, SET DIFFERENCE: R1  R2, CARTESIAN PRODUCT: R1  R2. For , , , the operand relations R1(A1,A2,,An) and R2(B1,B2,,Bn) must have the same number of attributes, and the domains of corresponding attributes must be compatible; that is, dom(Ai)=dom(Bi) for i=1,2,, n. This condition is called union compatibility. The resulting relation for , , or  has the same attribute names as the first operand R1 (by convention). JOIN Operation The sequence of Cartesian product followed by select is used quite commonly to identify and select related tuples from two relations, a special operation, called JOIN. It is denoted by This operation is very important for any relational database with more than a single relation, because it allows us to process relationships among relations. The general form of a join operation on two relations R(A1, A2, . . ., An) and S(B1, B2, . . ., Bm) is: R <join condition> S where R and S can be any relations that result from general relational algebra expressions. Types Equijoin Natural Join Theta Join sid bid 22 101 58 103day 10/10/99 11/12/99 sid sname age 22 Deepa 45.0 31 Laxmi 55.5 58 Roopa 35.0rating 7 8 10 sid sname age 28 Yamuna 35.0 31 Laxmi 55.5 44 Geeta 35.0rating 9 8 5 58 Roopa 35.0 10R1 S1 S2 sname Yamuna Laxmi Geetarating 9 8 5 Roopa 10 age 35.0sname, rating(S2) age(S2) 55.5 sid sname age 28 Yamuna 35.0rating 9 58 Roopa 35.0 10rating > 8(S2) sname Yamunarating 9 Roopa 10 sname, rating(S2) (rating > 8(S2)) sid sname age 22 Deepa 45.0 31 Laxmi 55.5 58 Roopa 35.0rating 7 8 10 44 Geeta 35.0 28 Yamuna 35.05 9 sid sname age 22 Deepa 45.0rating 7sid sname age 31 Laxmi 55.5 58 Roopa 35.0rating 8 10S1  S2 S1  S2S1  S2 (sid)bid 22 101 58 103day 10/10/99 11/12/99(sid)sname age 22 Deepa 45.0 22 Deepa 45.0 31 Laxmi 55.5rating 7 7 8 31 Laxmi 55.5 58 Roopa 35.0 58 Roopa 35.08 10 1022 101 10/10/99 58 103 11/12/99 22 101 10/10/99 58 103 11/12/99 Condition Join : (sid)bid 58 103 58 103day 11/12/99 11/12/99(sid)sname age 22 Deepa 45.0 31 Laxmi 55.5rating 7 8 bid 101 103day 10/10/99 11/12/99(sid)sname age 22 Deepa 45.0 58 Roopa 35.0rating 7 10 snopno s1 p1 s1 p2 s1 p3 s1 p4 s2 p1 s2 p2 s3 p2 s4 p2 s4 p4Apno p2pno p1 p2 p4pno p2 p4B1 B2 B3sno s1 s2 s3 s4sno s1 s4sno s1 A/B1 A/B2 A/B3Not supported as a primitive operator, but useful for expressing queries like: Find sailors who have reserved all boats . A B   1 2 1A B  2 3 r s A B  2 A B     1 2 4 1 2C D     a a b a bB 1 3 1 2 3D a a a b bE      r A B     1 1 1 1 2C D     a a a a bE     s nr s n Notation: r s r.A, r.B, r.C, r.D, s.E (r.B = s.Br.D = s.D (r x s)) )()(,,(),( ,,,2 2 11 21E n n n AF AFAF G GG   A B       C 7 7 3 10 g sum(c) (r) sum(c ) 27 Question: Which aggregate operations cannot be expressed using basic relational operations? branch_name g sum(balance) (account)branch_nameaccount_number balance Perryridge Perryridge Brighton Brighton RedwoodA-102 A-201 A-217 A-215 A-222400 900 750 750 700 branch_name sum(balance) Perryridge Brighton Redwood1300 1500 700 nRelation borrower customer_nameloan_number Jones Smith HayesL-170 L-230 L-1553000 4000 1700loan_number amount L-170 L-230 L-260branch_name Downtown Redwood Perryridge loan_number amount L-170 L-2303000 4000customer_name Jones Smithbranch_name Downtown Redwood Jones Smith nullloan_number amount L-170 L-230 L-2603000 4000 1700customer_name branch_name Downtown Redwood PerryridgeLeft Outer Join borrower loan loan_number amount L-170 L-230 L-1553000 4000 nullcustomer_name Jones Smith Hayesbranch_name Downtown Redwood null loan_number amount L-170 L-230 L-260 L-1553000 4000 1700 nullcustomer_name Jones Smith null Hayesbranch_name Downtown Redwood Perryridge nullFull Outer Join loan borrowerRight Outer Join loan borrower Question: can outerjoins be expressed using basic relational algebra operations Find the loan number for each loan of an amount greater than $1200 amount > 1200 (loan) loan_number (amount > 1200 (loan)) Find the names of all customers who have a loan, an account, or both, from the bank customer_name (borrower)  customer_name (depositor) n Find the names of all customers who have a loan at the Perryridge branch but do not have an account at any branch of the bank. customer_name (branch_name = Perryridge (borrower.loan_number = loan.loan_number(borrower x loan)))  customer_name(depositor)customer_name (branch_name=Perryridge (borrower.loan_number = loan.loan_number(borrower x loan))) l customer_name(loan.loan_number = borrower.loan_number ( (branch_name = Perryridge (loan)) x borrower))l customer_name (branch_name = Perryridge ( borrower.loan_number = loan.loan_number (borrower x loan))) 1.Database systems Models, Languages, Design and Application Programming, RamezElmasri and Shamkant B. Navathe, 7th Edition, 2017, Pearson. 2.Database Management Systems, Ramakrishnan, and Gehrke, 3rd Edition, 2014, McGraw Hill 3.Database System Concepts, Silberschatz Korth and Sudharshan,, 6th Edition, McGrawHill, 2013. 4.Database Principles Fundamentals of Design, Implementation and Management, Coronel, Morris, and Rob, Cengage Learning, 2012."
      }
    },
    {
      "id": "BloomLevel_2",
      "type": "BloomLevel",
      "properties": {
        "level": "Remember",
        "taxonomy_level": 1
      }
    },
    {
      "id": "BloomLevel_3",
      "type": "BloomLevel",
      "properties": {
        "level": "Understand",
        "taxonomy_level": 2
      }
    },
    {
      "id": "BloomLevel_4",
      "type": "BloomLevel",
      "properties": {
        "level": "Apply",
        "taxonomy_level": 3
      }
    },
    {
      "id": "BloomLevel_5",
      "type": "BloomLevel",
      "properties": {
        "level": "Analyze",
        "taxonomy_level": 4
      }
    },
    {
      "id": "BloomLevel_6",
      "type": "BloomLevel",
      "properties": {
        "level": "Evaluate",
        "taxonomy_level": 5
      }
    },
    {
      "id": "BloomLevel_7",
      "type": "BloomLevel",
      "properties": {
        "level": "Create",
        "taxonomy_level": 6
      }
    },
    {
      "id": "ProgramOutcome_8",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 1,
        "description": "PO1: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_9",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 2,
        "description": "PO2: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_10",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 3,
        "description": "PO3: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_11",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 4,
        "description": "PO4: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_12",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 5,
        "description": "PO5: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_13",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 6,
        "description": "PO6: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_14",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 7,
        "description": "PO7: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_15",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 8,
        "description": "PO8: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_16",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 9,
        "description": "PO9: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_17",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 10,
        "description": "PO10: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_18",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 11,
        "description": "PO11: Engineering Knowledge/Problem Analysis/etc."
      }
    },
    {
      "id": "ProgramOutcome_19",
      "type": "ProgramOutcome",
      "properties": {
        "po_number": 12,
        "description": "PO12: Engineering Knowledge/Problem Analysis/etc."
      }
    }
  ],
  "relationships": [],
  "paths": []
}